<!DOCTYPE HTML>
<html>
<?php
include('head.php');
?>
	<body class="is-preload">
		<!-- Wrapper -->
			<div id="wrapper">

<?php
include('header.php');
include('menu.php');
?>
				<!-- Main -->
					<div id="main">
						<div class="inner">
							<h1>よくある質問</h1>

							<div class="image main" id="faq">
								<img src="images/slider-image-2-1920x700.jpg" class="img-fluid" alt="" />
							</div>

							<h3>コースの構成はどのようになっていますか？</h3>

							<p>このコースは、リスニング、語彙、文法など、英語力を全体的に向上させることを目的としています。完全にオンラインで提供される非同期型のコースのため、自分の都合に合わせて、好きな時間・場所で学習を進めることができます。各コースは6週間の構成で、毎週、課題の提出や講師との面談が必須となります。柔軟な学習スタイルが可能な一方で、課題には締切があり、自己管理能力が求められる内容となっています。このコースはやりがいがあり、スピード感もあるため、効果的にコミュニケーションをとる力や、新しい知識をすばやく吸収する力を高めることができます。
							</p>
							
							<h3>毎週の課題が完了せずに翌週に持ち越された場合、どうなりますか？ポイントを失いますか？それとも、週が終わった後でも提出できますか？</h3>

							<p>学生は、コース週が終了した後でも課題を提出することができますが、すべての遅れた課題はコース終了までに完了する必要があります。最終週の課題については、コース終了後1週間以内であれば提出可能です。
							</p>
							
							<h3>学生が休暇を取ったり、病気になったり、その他の理由でコースを延期する必要がある場合はどうなりますか？
							</h3>

							<p>学生は、必要に応じてコースを1週間休止することができます。その際は、service@at-school-portal.com までスタッフにご連絡ください。可能であれば、コースは週の途中ではなく週の区切りで一時停止するのが理想的です。それ以上の長期の休止が必要な場合は、スタッフとの相談が必要になります。
							</p>

							<h3>6週間でどのくらい英語力が伸びますか？到達できる最高レベルはどこですか？</h3>

							<p>当校のコースは、英語を流暢かつ正確に使いこなし、自分の考えを自由に表現できる**上級ユーザー（Proficient User）**を目指して設計されています。言語レベルには、**ヨーロッパ言語共通参照枠（CEFR）**の6段階（A1～C2）を採用しています。当校の集中コース2つを受講することで、A1レベルからA2レベルへと進むことができます。その後も同様に進級していきます。ただし、Cレベルに近づくにつれて英語の習得が進むため、より高いCレベルでは、さらなる学習が必要になります。詳しくは、以下のインフォグラフィックをご覧ください。
							</p>

							<div class="col-lg-12 text-center">
									<img src="images/CEFRLevels.png" class="img-fluid" alt="" width="100%"/>
							</div>

							<h3></h3>

							<p></p>

							<h3></h3>

							<p></p>

							<h3></h3>

							<p></p>
						</div>
					</div>

<?php
include('contact_footer.php');
?>
	</body>
</html>