<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'enrol_imsenterprise', language 'hi', version '4.4'.
 *
 * @package     enrol_imsenterprise
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['aftersaving...'] = 'एक बार जब आप अपनी सेटिंग्स को सेव कर लेते हैं, तो आप चाह सकते हैं';
$string['allowunenrol'] = 'छात्रों और शिक्षकों को नामांकित न करने के लिए IMS डेटा की अनुमति देना';
$string['allowunenrol_desc'] = 'यदि सक्षम किया जाता है, तो उद्यम डेटा में निर्दिष्ट होने पर क्रम नामांकन हटा दिए जाएंगे।';
$string['basicsettings'] = 'बुनियादी सेटिंग्स';
$string['categoryidnumber'] = 'श्रेणी पहचान संख्या की अनुमति देना';
$string['categoryidnumber_desc'] = 'यदि सक्षम किया जाता है तो IMS उद्यम ID  संख्या के साथ एक श्रेणी बनाएगा।';
$string['categoryseparator'] = 'श्रेणी पृथक चरित्र';
$string['categoryseparator_desc'] = 'अपेक्षित है जब \'श्रेणी पहचान संख्या की अनुमति दें\' सक्षम हो। श्रेणी के नाम और पहचान संख्या को अलग करने के लिए चरित्र।';
$string['coursesettings'] = 'पाठ्यक्रम डेटा विकल्प';
$string['createnewcategories'] = 'यदि मूडल में नहीं पाया जाता है तो नई (छिपी हुई) क्रम श्रेणियाँ बनाएँ';
$string['createnewcategories_desc'] = 'If the &lt;org&gt;&lt;orgunit&gt; यदि क्रम के आने वाले डेटा में तत्व मौजूद है, तो इसकी सामग्री का उपयोग किसी श्रेणी को विनिर्देश करना के लिए किया जाएगा यदि क्रम को शुरू से ही बनाया जाना है। प्लगइन मौजूदा क्रम ों को फिर से वर्गीकृत नहीं करेगा। यदि वांछित नाम के साथ कोई श्रेणी मौजूद नहीं है, तो एक छिपी हुई श्रेणी बनाई जाएगी।';
$string['createnewcourses'] = 'यदि मूडल में नहीं पाए जाते हैं तो नए (छिपे हुए) पाठ्यक्रम बनाएँ';
$string['createnewcourses_desc'] = 'यदि सक्षम किया जाता है, तो IMS  उद्यम नामांकन प्लगइन IMS  डेटा में पाए जाने वाले किसी भी व्यक्ति के लिए नए पाठ्यक्रम बना सकता है, लेकिन मूडल के डेटाबेस में नहीं। कोई भी नवनिर्मित पाठ्यक्रम शुरू में छिपा हुआ है।';
$string['createnewusers'] = 'उन उपयोगकर्ताओं के लिए उपयोगकर्ता खाते बनाएँ जो अभी तक मूडल में पंजीकृत नहीं हैं';
$string['createnewusers_desc'] = 'IMS  उद्यम नामांकन डेटा आम तौर पर उपयोगकर्ताओं के एक समूह का वर्णन करता है। यदि सक्षम किया जाता है, तो किसी भी उपयोगकर्ता के लिए खाते बनाए जा सकते हैं जो मॉड्यूल डेटाबेस में नहीं पाए जाते हैं। उपयोगकर्ताओं को पहले उनके ID नंबर और फिर उनके मॉड्यूल उपयोगकर्ता नाम से खोजा जाता है। IMS  एंटरप्राइज प्लगइन द्वारा पासवर्ड आयात नहीं किए जाते हैं। उपयोगकर्ताओं को प्रमाणित करने के लिए प्रमाणीकरण प्लगइन के उपयोग की सिफारिश की जाती है।';
$string['cronfrequency'] = 'प्रसंस्करण की आवृत्ति';
$string['deleteusers'] = 'IMS डेटा में निर्दिष्ट होने पर उपयोगकर्ता खातों को निकाल देना दें';
$string['deleteusers_desc'] = 'यदि सक्षम किया जाता है, तो IMS  उद्यम नामांकन डेटा उपयोगकर्ता खातों को हटाने को विनिर्देश करना सकता है (यदि "रेकस्टेटस" झंडा 3 पर सेट किया गया है, जो एक खाते को विलोपन प्रतिनिधित्व करता है)। जैसा कि मॉड्यूल में स्तर है, उपयोगकर्ता अभिलेख वास्तव में मॉड्यूल के डेटाबेस से हटाया नहीं जाता है, लेकिन खाते को हटाए जाने के रूप में चिह्नित करने के लिए एक झंडा सेट किया जाता है।';
$string['disableenrolmentandremoveallroles'] = 'नामांकन स्थगित करें और भूमिकाओं को हटा दें';
$string['disableenrolonly'] = 'केवल नामांकन निलंबित करें';
$string['doitnow'] = 'अभी एक IMS  उद्यम अभिप्राय करें';
$string['emptyattribute'] = 'इसे खाली छुट्टी की दरखास्त';
$string['filelockedmail'] = 'IMS-दाखिल करना-आधारित नामांकन ({$a}) के लिए आप जिस पाठ दाखिल करना का उपयोग कर रहे हैं, उसे क्रोन प्रक्रम द्वारा निकाल देनाया नहीं जा सकता है। इसका आमतौर पर मतलब है कि इस पर अनुमतियाँ गलत हैं। कृपया अनुमतियों को निश्चित करना ताकि मूडल दाखिल करना को निकाल देना सके, अन्यथा इसे बार-बार संसाधित किया जा सकता है।';
$string['filelockedmailsubject'] = 'महत्त्वपूर्ण त्रुटि: नामांकन दाखिल करना';
$string['fixcasepersonalnames'] = 'व्यक्तिगत नामों को शीर्षक मामले में बदलें';
$string['fixcaseusernames'] = 'उपयोगकर्ता नामों को निचले मामले में बदलें';
$string['ignore'] = 'नजरअंदाज करें';
$string['importimsfile'] = 'IMS  उद्यम दाखिल करना अभिप्राय करें';
$string['imsenterprise:config'] = 'IMS उद्यम नामांकन उदाहरणों को कॉन्फ़िगर करें';
$string['imsenterprisecrontask'] = 'नामांकन दाखिल करना प्रसंस्करण';
$string['imsrolesdescription'] = 'IMS  उद्यम विर्निदेश, विनिर्देशन, विशिष्टि में 8 अलग-अलग भूमिका प्रकार शामिल हैं। कृपया चुनें कि आप चाहते हैं कि उन्हें मूडल में कैसे नियुक्त किया जाए, जिसमें यह भी शामिल है कि क्या उनमें से किसी को भी नजरअंदाज किया जाना चाहिए।';
$string['location'] = 'दाखिल करना स्थान';
$string['logtolocation'] = 'लॉग दाखिल करना आउटपुट स्थान (बिना लॉगिंग के खाली)';
$string['mailadmins'] = 'ईमेल द्वारा प्रशासक को सूचित करें';
$string['mailusers'] = 'ईमेल द्वारा उपयोगकर्ताओं को सूचित करें';
$string['messageprovider:imsenterprise_enrolment'] = 'IMS  उद्यम नामांकन संदेश';
$string['miscsettings'] = 'फुटकर';
$string['nestedcategories'] = 'घोंसले की श्रेणियों की अनुमति देना';
$string['nestedcategories_desc'] = 'यदि सक्षम किया जाता है तो आई. एम. एस. उद्यम घोंसले वाली श्रेणियां बनाएगा।';
$string['noaction'] = 'कोई कार्रवाई नहीं';
$string['pluginname'] = 'IMS उद्यम दाखिल करना';
$string['pluginname_desc'] = 'यह प्रणाली बार-बार उस स्थान पर एक विशेष रूप से प्रारूपित पाठ दाखिल करना की जांच और प्रसंस्करण करेगी जिसे आप विशिष्टताएँ करना हैं। दाखिल करना को व्यक्ति, समूह और सदस्यता XML तत्वों वाले IMS  उद्यम विशिष्टताएँों का पालन करना चाहिए।';
$string['privacy:metadata'] = 'IMS  एंटरप्राइज दाखिल करना नामांकन प्लगइन किसी भी व्यक्तिगत डेटा को संग्रहीत नहीं करता है।';
$string['processphoto'] = 'प्रोफ़ाइल में उपयोगकर्ता फोटो डेटा जोड़ें';
$string['processphotowarning'] = 'चेतावनी: छवि प्रसंस्करण से सर्वर पर एक महत्वपूर्ण, सार्थक बोझ पड़ने की संभावना है। यदि बड़ी संख्या में छात्रों को संसाधित किए जाने की उम्मीद है तो आपको इस विकल्प को सक्रिय नहीं करने की सलाह दी जाती है।';
$string['removeenrolmentandallroles'] = 'नामांकन और भूमिकाओं को निकाल देना';
$string['restricttarget'] = 'केवल प्रक्रम डेटा यदि निम्नलिखित लक्ष्य निर्दिष्ट किया गया है';
$string['restricttarget_desc'] = 'एक IMS उद्यम डेटा दाखिल करना कई "लक्ष्यों" के लिए अभिप्रेत हो सकती है-विभिन्नLMSes, अथवा एक स्कूल/विश्वविद्अथवालय के भीतर विभिन्न प्रणालिअथवाँ। उद्यम दाखिल करना में यह विनिर्देश करना संभव है कि डेटा एक अथवा अधिक नामित लक्ष्य प्रणालियों के लिए है, उन्हें <properties> टैग के भीतर निहित <target> टैग में नामित करके। जनरल तौर पर आपको इसके बारे में चिंता करने की आवश्यकता नहीं है। सेटिंग को खाली छुट्टी की दरखास्त और मूडल हमेशा डेटा दाखिल करना को संसाधित करेगा, चाहे कोई लक्ष्य निर्दिष्ट हो अथवा नहीं। अन्यथा, सटीक नाम भरें जो <target> टैग के भीतर, अंदर आउटपुट होगा।';
$string['roles'] = 'भूमिकाएँ';
$string['settingfullname'] = 'क्रम के लिए IMS विवरण टैग पूरा नाम';
$string['settingfullnamedescription'] = 'पूरा नाम एक अपेक्षित क्रम क्षेत्र है इसलिए आपको अपनी IMS उद्यम दाखिल करना में चयनित विवरण टैग को परिभाषित करना होगा।';
$string['settingshortname'] = 'क्रम के छोटे नाम के लिए IMS  विवरण टैग';
$string['settingshortnamedescription'] = 'लघुनाम एक अपेक्षित क्रम क्षेत्र है इसलिए आपको अपनी IMS  उद्यम दाखिल करना में चयनित विवरण टैग को परिभाषित करना होगा।';
$string['settingsummary'] = 'क्रम सारांश के लिए IMS विवरण टैग';
$string['settingsummarydescription'] = 'एक वैकल्पिक क्षेत्र है, यदि आप क्रम सारांश विनिर्देश करना नहीं करना चाहते हैं तो \'इसे खाली छोड़ दें\' का चयन करें।';
$string['sourcedidfallback'] = 'यदि \'उपयोगकर्ता\' क्षेत्र नहीं मिला है तो उपयोगकर्ता के उपयोगकर्ता के लिए \'स्रोत\' का उपयोग करें';
$string['sourcedidfallback_desc'] = 'IMS डेटा में, <sourcedid> फ़ील्ड स्रोत सिस्टम में उपयोग किए गए व्यक्ति के स्थायी ID कोड को दर्शाता है। <userid> फ़ील्ड एक अलग फ़ील्ड है जिसमें उपयोगकर्ता द्वारा लॉगिन करते समय उपयोग किया गया आईडी कोड होना चाहिए। कई मामलों में ये दोनों कोड समान हो सकते हैं - लेकिन हमेशा नहीं।

कुछ छात्र सूचना प्रणालियाँ <userid> फ़ील्ड को आउटपुट नहीं करती हैं। यदि ऐसा है, तो आपको <sourcedid> को मूडल उपयोगकर्ता आईडी के रूप में उपयोग करने की अनुमति देने के लिए इस सेटिंग को सक्षम करना चाहिए। अन्यथा, इस सेटिंग को अक्षम रहने दें।';
$string['truncatecoursecodes'] = 'क्रम कोड को इस लंबाई में काटें';
$string['truncatecoursecodes_desc'] = 'कुछ स्थितियों में आपके पास कोर्स कोड हो सकते हैं जिन्हें आप प्रसंस्करण से पहले एक निर्दिष्ट लंबाई तक कम करना चाहते हैं। यदि ऐसा है, तो इस डिब्बे में वर्णों की संख्या दर्ज करें। अन्यथा, डिब्बे को खाली छुट्टी की दरखास्त और कोई कटौती नहीं होगी।';
$string['unenrolaction'] = 'पंजीकरण रद्द करने की कार्रवाई';
$string['unenrolaction_desc'] = 'जब कोई उपयोगकर्ता किसी क्रम से नामांकन रद्द कर देता है तो कार्रवाई की जानी चाहिए (केवल तभी लागू होती है जब ऊपर नामांकन रद्द करने की सेटिंग सक्षम हो)।';
$string['updatecourses'] = 'क्रम को अद्यतन';
$string['updatecourses_desc'] = 'यदि सक्षम है, तो IMS  उद्यम नामांकन प्लगइन क्रम के पूर्ण और संक्षिप्त नामों को अद्यतन सकता है (यदि "रेकस्टेटस" झंडा 2 पर सेट किया गया है, जो एक अद्यतन का प्रतिनिधित्व करता है)।';
$string['updateusers'] = 'IMS  डेटा में निर्दिष्ट होने पर उपयोगकर्ता खातों को अद्यतन';
$string['updateusers_desc'] = 'यदि सक्षम है, तो आई. एम. एस. उद्यम नामांकन डेटा उपयोगकर्ता खातों में परिवर्तनों को विनिर्देश करना सकता है (यदि "रेकस्टेटस" फ्लैग 2 पर सेट किया गया है, जो एक अद्यतन का प्रतिनिधित्व करता है)।';
$string['usecapitafix'] = 'यदि प्रति व्यक्ति का उपयोग किया जाता है तो इस बॉक्स को टिक करें (क्योंकि उनका XML प्रारूप थोड़ा अलग है)';
$string['usecapitafix_desc'] = 'प्रति व्यक्ति द्वारा उत्पादित छात्र डेटा तंत्र के XML आउटपुट में एक मामूली त्रुटि पाई गई है। यदि आप प्रति व्यक्ति का उपयोग कर रहे हैं तो आपको इस सेटिंग को सक्षम करना चाहिए-अन्यथा इसे अन-टिक छोड़ देना चाहिए।';
$string['usersettings'] = 'उपयोगकर्ता डेटा विकल्प';
$string['zeroisnotruncation'] = '0 इंगित करता है कि कोई कटौती नहीं है';
