<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'install', language 'hi', version '4.4'.
 *
 * @package     install
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['admindirerror'] = 'निर्दिष्ट व्यवस्थापक निर्देशिका गलत है';
$string['admindirname'] = 'प्रशासक निर्देशिका';
$string['admindirsetting'] = 'बहुत कम वेबहोस्ट /admin को एक विशेष URL के रूप में उपयोग करते हैं, जिसके माध्यम से आप कंट्रोल पैनल या अन्य किसी चीज़ तक पहुँच सकते हैं।
दुर्भाग्य से, यह Moodle एडमिन पेजों के मानक स्थान से मेल नहीं खाता।
आप इसे अपने इंस्टॉलेशन में admin डायरेक्टरी का नाम बदलकर और उस नए नाम को यहाँ डालकर ठीक कर सकते हैं।
उदाहरण के लिए: <br /> <br /><b>moodleadmin</b><br /> <br />

इससे Moodle में एडमिन लिंक की समस्या हल हो जाएगी।';
$string['admindirsettinghead'] = 'प्रशासक निर्देशिका निर्धारित करना।....';
$string['admindirsettingsub'] = 'बहुत कम वेबहोस्ट /admin को एक विशेष URL के रूप में उपयोग करते हैं, जिसके माध्यम से आप कंट्रोल पैनल या अन्य किसी चीज़ तक पहुँच सकते हैं।
दुर्भाग्य से, यह Moodle एडमिन पेजों के मानक स्थान से मेल नहीं खाता।
आप इसे अपने इंस्टॉलेशन में admin डायरेक्टरी का नाम बदलकर और उस नए नाम को यहाँ डालकर ठीक कर सकते हैं।
उदाहरण के लिए: <br /> <br /><b>moodleadmin</b><br /> <br />

इससे Moodle में एडमिन लिंक की समस्या हल हो जाएगी।';
$string['availablelangs'] = 'उपलब्ध भाषा पैक';
$string['caution'] = 'सावधानी बरतें';
$string['chooselanguage'] = 'एक भाषा चुनें';
$string['chooselanguagehead'] = 'एक भाषा चुनें';
$string['chooselanguagesub'] = 'कृपया अधिष्ठापन के लिए एक भाषा चुनें। इस भाषा का उपयोग साइट के लिए चूकना भाषा के रूप में भी किया जाएगा, हालांकि इसे बाद में बदला जा सकता है।';
$string['cliadminemail'] = 'नया प्रशासक उपयोगकर्ता ईमेल सम्बोधन';
$string['cliadminpassword'] = 'नया प्रशासक उपयोगकर्ता पासवर्ड';
$string['cliadminusername'] = 'प्रशासक खाता उपयोगकर्ता नाम';
$string['clialreadyconfigured'] = 'कॉन्फ़िगरेशन फ़ाइल config.php पहले से मौजूद है। कृपया इस साइट के लिए Moodle इंस्टॉल करने के लिए admin/cli/install_database.php का उपयोग करें।';
$string['clialreadyinstalled'] = 'कॉन्फ़िगरेशन फ़ाइल config.php पहले से मौजूद है। कृपया इस साइट के लिए Moodle इंस्टॉल करने के लिए admin/cli/install_database.php का उपयोग करें।';
$string['cliinstallfinished'] = 'अधिष्ठापन सफलतापूर्वक पूरी हुई।';
$string['cliinstallheader'] = 'मूडल {$a} कमांड लाइन अधिष्ठापन कार्यक्रम';
$string['climustagreelicense'] = 'गैर-संवादात्मक प्रकार, विधा में आपको-- सहमत-लाइसेंस विकल्प निर्दिष्ट करके लाइसेंस के लिए सहमत होना चाहिए।';
$string['cliskipdatabase'] = 'डेटाबेस अधिष्ठापन को छोड़ना।';
$string['clisupportemail'] = 'ईमेल पते का समर्थन करें';
$string['clitablesexist'] = 'डेटाबेस तालिकाएँ पहले से मौजूद हैं; CLI  अधिष्ठापन जारी नहीं रह सकती है।';
$string['compatibilitysettings'] = 'अपनी PHP सेटिंग्स की जाँच करें।....';
$string['compatibilitysettingshead'] = 'अपनी PHP सेटिंग्स की जाँच करें।....';
$string['compatibilitysettingssub'] = 'मॉड्यूल को ठीक से चलाने के लिए आपके सर्वर को इन सभी परीक्षणों को पास करना चाहिए।';
$string['configfilenotwritten'] = 'इंस्टॉलर आलेख स्वचालित रूप से आपकी चुनी हुई सेटिंग्स वाली एक config.php दाखिल करना बनाने में सक्षम नहीं थी, शायद इसलिए कि मूडल निर्देशिका लिखने योग्य नहीं है। आप निम्नलिखित कोड को मूडल की मूल निर्देशिका के भीतर config.php नामक दाखिल करना में मैन्युअल रूप से कॉपी कर सकते हैं।';
$string['configfilewritten'] = 'config.php सफलतापूर्वक बनाया गया है';
$string['configurationcomplete'] = 'विन्यास पूरा हुआ';
$string['configurationcompletehead'] = 'विन्यास पूरा हुआ';
$string['configurationcompletesub'] = 'मूडल ने आपके मूडल अधिष्ठापन की जड़ में एक दाखिल करना में आपके विन्यास को सहेजने का प्रयास किया।';
$string['database'] = 'डेटाबेस';
$string['databasehead'] = 'डेटाबेस सेटिंग्स';
$string['databasehost'] = 'डेटाबेस मेजबान';
$string['databasename'] = 'डेटाबेस का नाम';
$string['databasepass'] = 'डेटाबेस पासवर्ड';
$string['databaseport'] = 'डेटाबेस पोर्ट';
$string['databasesocket'] = 'यूनिक्स साकेट';
$string['databasetypehead'] = 'डेटाबेस चालक चुनें';
$string['databasetypesub'] = 'मूडल कई प्रकार के डेटाबेस सर्वर का समर्थन करता है। यदि आप नहीं जानते कि किस प्रकार का उपयोग करना है तो कृपया सर्वर प्रशासक से संपर्क करें।';
$string['databaseuser'] = 'डेटाबेस उपयोगकर्ता';
$string['dataroot'] = 'डेटा निर्देशिका';
$string['datarooterror'] = 'आपके द्वारा निर्दिष्ट \'डेटा निर्देशिका\' नहीं मिली अथवा नहीं बनाई जा सकी। अथवा तो मार्ग को सही करें अथवा उस निर्देशिका को मैन्युअल रूप से बनाएं।';
$string['datarootpermission'] = 'डेटा निर्देशिकाओं की अनुमति';
$string['datarootpublicerror'] = 'आपके द्वारा निर्दिष्ट \'डेटा निर्देशिका\' सीधे वेब के माध्यम से सुलभ है, आपको एक अलग निर्देशिका का उपयोग करना चाहिए।';
$string['dbconnectionerror'] = 'हम आपके द्वारा निर्दिष्ट डेटाबेस से जुड़ नहीं सके। कृपया अपनी डेटाबेस सेटिंग्स की जाँच करें।';
$string['dbcreationerror'] = 'डेटाबेस निर्माण त्रुटि। बशर्ते, यह कि गई सेटिंग्स के साथ दिए गए डेटाबेस का नाम नहीं बना सके';
$string['dbhost'] = 'मेजबान सर्वर';
$string['dbpass'] = 'कूटशब्द';
$string['dbport'] = 'बंदरगाह';
$string['dbprefix'] = 'तालिका उपसर्ग';
$string['dbtype'] = 'प्रकार';
$string['directorysettings'] = '<b>वेब पता:</b>
वह पूरा वेब पता निर्दिष्ट करें जहाँ से Moodle को एक्सेस किया जाएगा।

यदि आपकी वेबसाइट कई URL के माध्यम से एक्सेस की जा सकती है, तो वह URL चुनें जो आपके छात्रों द्वारा सबसे आसानी से उपयोग किया जा सके।
अंत में स्लैश न लगाएं।
<br />
<br />
<b>Moodle डायरेक्टरी:</b>
इस इंस्टॉलेशन का पूरा डायरेक्टरी पाथ निर्दिष्ट करें।
सुनिश्चित करें कि अपर/लोअर केस सही हैं।
<br />
<br />
<b>डेटा डायरेक्टरी:</b>
आपको एक ऐसी जगह चाहिए जहाँ Moodle अपलोड की गई फ़ाइलों को सहेज सके। यह डायरेक्टरी वेब सर्वर उपयोगकर्ता (आमतौर पर \'nobody\' या \'apache\') द्वारा पठनीय और लेखनीय होनी चाहिए,
लेकिन यह वेब के माध्यम से सीधे एक्सेस योग्य नहीं होनी चाहिए।
यदि यह मौजूद नहीं है, तो इंस्टॉलर इसे बनाने का प्रयास करेगा।';
$string['directorysettingshead'] = 'कृपया इस मूडल अधिष्ठापन के स्थानों की पुष्टि';
$string['directorysettingssub'] = '<b>वेब पता:</b>
वह पूरा वेब पता निर्दिष्ट करें जहाँ से Moodle को एक्सेस किया जाएगा।

यदि आपकी वेबसाइट कई URL के माध्यम से एक्सेस की जा सकती है, तो वह URL चुनें जो आपके छात्रों द्वारा सबसे आसानी से उपयोग किया जा सके।
अंत में स्लैश न लगाएं।
<br />
<br />
<b>Moodle डायरेक्टरी:</b>
इस इंस्टॉलेशन का पूरा डायरेक्टरी पाथ निर्दिष्ट करें।
सुनिश्चित करें कि अपर/लोअर केस सही हैं।
<br />
<br />
<b>डेटा डायरेक्टरी:</b>
आपको एक ऐसी जगह चाहिए जहाँ Moodle अपलोड की गई फ़ाइलों को सहेज सके। यह डायरेक्टरी वेब सर्वर उपयोगकर्ता (आमतौर पर \'nobody\' या \'apache\') द्वारा पठनीय और लेखनीय होनी चाहिए,
लेकिन यह वेब के माध्यम से सीधे एक्सेस योग्य नहीं होनी चाहिए।
यदि यह मौजूद नहीं है, तो इंस्टॉलर इसे बनाने का प्रयास करेगा।';
$string['dirroot'] = 'मूडल निर्देशिका';
$string['dirrooterror'] = '\'मूडल निर्देशिका\' सेटिंग गलत लगती है-हमें वहाँ एक मूडल अधिष्ठापन नहीं मिल सकती है। नीचे दिया गया मान रीसेट कर दिया गया है।';
$string['download'] = 'डाउनलोड करें';
$string['downloadlanguagebutton'] = '"{$a}" भाषा पैक डाउनलोड करें';
$string['downloadlanguagehead'] = 'भाषा पैक डाउनलोड करें';
$string['downloadlanguagenotneeded'] = 'आप चूकना भाषा पैक, "{$a}" का उपयोग करके अधिष्ठापन प्रक्रम जारी रख सकते हैं।';
$string['downloadlanguagesub'] = 'अब आपके पास एक भाषा पैक डाउनलोड करने और इस भाषा में अधिष्ठापन प्रक्रम जारी रखने का विकल्प है। <br /><br /> यदि आप भाषा पैक डाउनलोड करने में असमर्थ हैं, तो अधिष्ठापन प्रक्रम अंग्रेजी में जारी रहेगी। (एक बार अधिष्ठापन प्रक्रम पूरी हो जाने के बाद, आपको अतिरिक्त भाषा पैक डाउनलोड और स्थापित करने का अवसर मिलेगा।)';
$string['doyouagree'] = 'क्या आप सहमत हैं? (हाँ/नहीं):';
$string['environmenthead'] = 'अपने पर्यावरण की जाँच करें।....';
$string['environmentsub'] = 'हम जाँच कर रहे हैं कि क्या आपके सिस्टम के विविध, विभिन्न घटक सिस्टम की आवश्यकताओं को पूरा करते हैं';
$string['environmentsub2'] = 'प्रत्येक मूडल रिलीज में कुछ न्यूनतम, कम से कम PHP संस्करण अपेक्षा, आवश्यकता और कई अनिवार्य पी. एच. पी. विस्तार होते हैं। प्रत्येक स्थापना और उन्नयन करना से पहले पूर्ण पर्अथवावरण जांच की जाती है। यदि आप नहीं जानकारी कि नअथवा संस्करण कैसे स्थापित करना है अथवा PHP  विस्तार को सक्षम करना है तो कृपअथवा सर्वर प्रशासक से संपर्क करें।';
$string['errorsinenvironment'] = 'पर्यावरण जांच विफल रही!';
$string['fail'] = 'विफल';
$string['fileuploads'] = 'दाखिल करना अपलोड';
$string['fileuploadserror'] = 'यह चालू होना चाहिए';
$string['fileuploadshelp'] = '<p> आपके सर्वर पर दाखिल करना अपलोड करना अक्षम प्रतीत होता है। </p> <p> मूडल अभी भी स्थापित किअथवा जा सकता है, लेकिन इस योग्यता के बिना, आप क्रम दाखिल करनाों अथवा नई उपयोगकर्ता प्रोदाखिल करना छवियों को अपलोड नहीं कर पाएंगे। </p> <p> दाखिल करना अपलोड को सक्षम करने के लिए आपको (अथवा आपके सिस्टम प्रशासक) अपने सिस्टम पर मुख्य php.ini दाखिल करना को संपादित करने और <b> file_uploads </b> के लिए सेटिंग को \'1\' में बदलने की आवश्यकता होगी।';
$string['inputdatadirectory'] = 'डेटा निर्देशिकाः';
$string['inputwebadress'] = 'वेब सम्बोधन:';
$string['inputwebdirectory'] = 'मूडल निर्देशिकाः';
$string['installation'] = 'अधिष्ठापन';
$string['invaliddbprefix'] = 'अमान्य उपसर्ग। उपसर्ग में केवल निचले अक्षर और अंडरस्कोर हो सकते हैं।';
$string['langdownloaderror'] = 'दुर्भाग्य से "{$a}" भाषा डाउनलोड नहीं की जा सकी। अधिष्ठापन प्रक्रम अंग्रेजी में जारी रहेगी।';
$string['langdownloadok'] = 'भाषा "{$a}" सफलतापूर्वक स्थापित की गई थी। इस भाषा में अधिष्ठापन प्रक्रम जारी रहेगी।';
$string['memorylimit'] = 'स्मृति सीमा';
$string['memorylimiterror'] = 'PHP स्मृति सीमा काफी कम निर्धारित की गई है... आपको बाद में समस्या हो सकती है।';
$string['memorylimithelp'] = '<p>आपके सर्वर के लिए PHP मेमोरी सीमा वर्तमान में {$a} पर सेट है।</p>

<p>इससे Moodle को बाद में मेमोरी संबंधी समस्याएँ हो सकती हैं, विशेष रूप से

यदि आपने कई मॉड्यूल सक्रिय किए हैं और/या कई उपयोगकर्ता हैं।</p>

<p>हमारा सुझाव है कि यदि संभव हो तो आप PHP को उच्च सीमा, जैसे 40M, पर कॉन्फ़िगर करें।

ऐसा करने के कई तरीके हैं जिन्हें आप आज़मा सकते हैं:</p>
<ol>
<li>यदि संभव हो, तो PHP को <i>--enable-memory-limit</i> के साथ पुनः संकलित करें।

इससे Moodle स्वयं मेमोरी सीमा निर्धारित कर सकेगा।</li>
<li>यदि आपके पास अपनी php.ini फ़ाइल तक पहुँच है, तो आप उसमें <b>memory_limit</b>
सेटिंग को 40M जैसी किसी मान पर बदल सकते हैं।</li> यदि आपके पास पहुँच नहीं है, तो आप
अपने व्यवस्थापक से यह करने के लिए कह सकते हैं।</li>
<li>कुछ PHP सर्वरों पर, आप Moodle निर्देशिका में एक .htaccess फ़ाइल बना सकते हैं,

जिसमें यह पंक्ति हो:

<blockquote><div>php_value memory_limit 40M</div></blockquote>
<p>हालाँकि, कुछ सर्वरों पर यह सभी PHP पृष्ठों को काम करने से रोक देगा
(पृष्ठों को देखते समय आपको त्रुटियाँ दिखाई देंगी), इसलिए आपको .htaccess फ़ाइल को हटाना होगा।</p></li>
</ol>';
$string['mysqliextensionisnotpresentinphp'] = 'PHP को MySQLi एक्सटेंशन के साथ ठीक से कॉन्फ़िगर नहीं किया गया है ताकि यह MySQL के साथ संचार कर सके। कृपया अपनी php.ini फ़ाइल की जाँच करें या PHP को पुनः कंपाइल करें।';
$string['nativeauroramysqlhelp'] = '<p>डेटाबेस वह जगह है जहाँ Moodle की अधिकांश सेटिंग्स और डेटा संग्रहीत होते हैं और इसे यहीं कॉन्फ़िगर किया जाना चाहिए।</p>
<p>डेटाबेस का नाम, उपयोगकर्ता नाम और पासवर्ड आवश्यक फ़ील्ड हैं; टेबल प्रीफ़िक्स वैकल्पिक है।</p>
<p>डेटाबेस के नाम में केवल अल्फ़ान्यूमेरिक अक्षर, डॉलर ($) और अंडरस्कोर (_) हो सकते हैं।</p>
<p>यदि डेटाबेस वर्तमान में मौजूद नहीं है, और आपके द्वारा निर्दिष्ट उपयोगकर्ता के पास अनुमति है, तो Moodle सही अनुमतियों और सेटिंग्स के साथ एक नया डेटाबेस बनाने का प्रयास करेगा।</p>
<p>यह ड्राइवर पुराने MyISAM इंजन के साथ संगत नहीं है।</p>';
$string['nativemariadbhelp'] = '<p>डेटाबेस वह जगह है जहाँ Moodle की अधिकांश सेटिंग्स और डेटा संग्रहीत होते हैं और इसे यहीं कॉन्फ़िगर किया जाना चाहिए।</p>
<p>डेटाबेस का नाम, उपयोगकर्ता नाम और पासवर्ड आवश्यक फ़ील्ड हैं; टेबल प्रीफ़िक्स वैकल्पिक है।</p>
<p>डेटाबेस के नाम में केवल अल्फ़ान्यूमेरिक अक्षर, डॉलर ($) और अंडरस्कोर (_) हो सकते हैं।</p>
<p>यदि डेटाबेस वर्तमान में मौजूद नहीं है, और आपके द्वारा निर्दिष्ट उपयोगकर्ता के पास अनुमति है, तो Moodle सही अनुमतियों और सेटिंग्स के साथ एक नया डेटाबेस बनाने का प्रयास करेगा।</p>
<p>यह ड्राइवर पुराने MyISAM इंजन के साथ संगत नहीं है।</p>';
$string['nativemysqlihelp'] = '<p>डेटाबेस वह जगह है जहाँ Moodle की अधिकांश सेटिंग्स और डेटा संग्रहीत होते हैं और इसे यहीं कॉन्फ़िगर किया जाना चाहिए।</p>
<p>डेटाबेस का नाम, उपयोगकर्ता नाम और पासवर्ड आवश्यक फ़ील्ड हैं; टेबल प्रीफ़िक्स वैकल्पिक है।</p>
<p>डेटाबेस के नाम में केवल अल्फ़ान्यूमेरिक अक्षर, डॉलर ($) और अंडरस्कोर (_) हो सकते हैं।</p>
<p>यदि डेटाबेस वर्तमान में मौजूद नहीं है, और आपके द्वारा निर्दिष्ट उपयोगकर्ता के पास अनुमति है, तो Moodle सही अनुमतियों और सेटिंग्स के साथ एक नया डेटाबेस बनाने का प्रयास करेगा।</p>';
$string['nativeocihelp'] = 'अब आपको डेटाबेस को कॉन्फ़िगर करने की आवश्यकता है जहाँ अधिकांश मॉड्यूल डेटा संग्रहीत किया जाएगा। इस डेटाबेस को पहले ही बनाया जा चुका होना चाहिए और इसे एक्सेस करने के लिए एक उपयोगकर्ता नाम और पासवर्ड बनाया गया होना चाहिए। टेबल उपसर्ग अनिवार्य है।';
$string['nativepgsqlhelp'] = '<p> डेटाबेस वह जगह है जहाँ अधिकांश मॉड्यूल सेटिंग्स और डेटा संग्रहीत किए जाते हैं और इसे यहाँ कॉन्फ़िगर किया जाना चाहिए। </p> <p> डेटाबेस नाम, उपयोगकर्ता नाम, पासवर्ड और टेबल उपसर्ग अपेक्षित क्षेत्र हैं। </p> <p> डेटाबेस पहले से मौजूद होना चाहिए और उपयोगकर्ता के पास दोनों को पढ़ने और लिखने की पहुँच होनी चाहिए। .</p>';
$string['nativesqlsrvhelp'] = 'अब आपको डेटाबेस को कॉन्फ़िगर करने की आवश्यकता है जहाँ अधिकांश मॉड्यूल डेटा संग्रहीत किया जाएगा। इस डेटाबेस को पहले ही बनाया जा चुका होना चाहिए और इसे एक्सेस करने के लिए एक उपयोगकर्ता नाम और पासवर्ड बनाया गया होना चाहिए। टेबल उपसर्ग अनिवार्य है।';
$string['nativesqlsrvnodriver'] = 'PHP के लिए Microsoft SQL Server ड्राइवर इंस्टॉल नहीं हैं या ठीक से कॉन्फ़िगर नहीं किए गए हैं।';
$string['ociextensionisnotpresentinphp'] = 'PHP को OCI8 एक्सटेंशन के साथ ठीक से कॉन्फ़िगर नहीं किया गया है ताकि यह Oracle के साथ संचार कर सके। कृपया अपनी php.ini फ़ाइल की जाँच करें या PHP को पुनः कंपाइल करें।';
$string['pass'] = 'पास करें';
$string['paths'] = 'रास्ते';
$string['pathserrcreatedataroot'] = 'डेटा निर्देशिका ({$a-> dataroot}) इंस्टॉलर द्वारा नहीं बनाई जा सकती है।';
$string['pathshead'] = 'रास्तों की पुष्टि';
$string['pathsrodataroot'] = 'डेटारूट निर्देशिका लिखित नहीं है।';
$string['pathsroparentdataroot'] = 'मूल निर्देशिका ({$a-> parent}) लिखने योग्य नहीं है। डेटा निर्देशिका ({$a-> dataroot}) इंस्टॉलर द्वारा नहीं बनाई जा सकती है।';
$string['pathssubadmindir'] = 'बहुत कम वेबहोस्ट नियंत्रण कक्ष अथवा किसी चीज़ तक पहुँचने के लिए आपके लिए एक विशेष URL के रूप में प्रशासक का उपयोग करते हैं। दुर्भाग्य से यह मूडल प्रशासक पृष्ठों के लिए स्तर स्थान के साथ संघर्ष करता है। आप अपने इंस्टॉलेशन में प्रशासक निर्देशिका का नाम बदलकर और उस नए नाम को यहाँ रखकर इसे निश्चित करना सकते हैं। उदाहरण के लिए: <em>moodleadmin</em> यह मूडल में प्रशासक लिंक को निश्चित करनाेगा।';
$string['pathssubdataroot'] = '<p> एक निर्देशिका जहाँ मूडल उपयोगकर्ताओं द्वारा अपलोड की गई सभी दाखिल करना सामग्री को संग्रहीत करेगा। </p> <p> यह निर्देशिका वेब सर्वर उपयोगकर्ता (आमतौर पर \'www-data\', \'कोई नहीं\' अथवा \'अपाचे\') द्वारा पढ़ने योग्य और लिखने योग्य दोनों होनी चाहिए। </p> <p> यह सीधे वेब पर सुलभ नहीं होना चाहिए। </p> <p> यदि निर्देशिका वर्तमान में मौजूद नहीं है, तो अधिष्ठापन प्रक्रम इसे बनाने का प्रअथवास करेगी। </p>';
$string['pathssubdirroot'] = '<p> मॉड्यूल कोड वाली निर्देशिका का पूरा मार्ग। </p>';
$string['pathssubwwwroot'] = '<p> पूरा सम्बोधन जहाँ मूडल तक पहुँचा जाएगा i.e। वह सम्बोधन जिसे उपयोगकर्ता मूडल तक पहुँचने के लिए अपने ब्राउज़र के पते की पट्टी में दर्ज करेंगे। </p> <p> कई पतों का उपयोग करके मूडल तक पहुँचना संभव नहीं है। यदि आपकी साइट कई पतों के माध्यम से सुलभ है तो सबसे आसान का चयन करें और अन्य पतों में से प्रत्येक के लिए एक स्थायी पुनर्निर्देश स्थापित करें। </p> <p> यदि आपकी साइट इंटरनेट और आंतरिक नेटवर्क (जिसे कभी-कभी इंट्रानेट कहा जाता है) दोनों से सुलभ है, तो यहाँ सार्वजनिक पते का उपयोग करें। </p> <p> यदि चालू, प्रचलित सम्बोधन सही नहीं है, तो कृपया अपने ब्राउज़र के पते की पट्टी में यूआरएल बदलें और स्थापना को फिर से शुरू करें। </p>';
$string['pathsunsecuredataroot'] = 'डेटारूट स्थान सुरक्षित नहीं है';
$string['pathswrongadmindir'] = 'प्रशासक निर्देशिका मौजूद नहीं है';
$string['pgsqlextensionisnotpresentinphp'] = 'PHP को PGSQL एक्सटेंशन के साथ ठीक से कॉन्फ़िगर नहीं किया गया है ताकि यह PostgreSQL के साथ संचार कर सके। कृपया अपनी php.ini फ़ाइल की जाँच करें या PHP को पुनः कंपाइल करें।';
$string['phpextension'] = '{$a} PHP विस्तार';
$string['phpversion'] = 'PHP संस्करण';
$string['phpversionhelp'] = '<p>Moodle के लिए PHP का कम से कम 5.6.5 या 7.1 संस्करण आवश्यक है (7.0.x में कुछ इंजन संबंधी सीमाएँ हैं)।</p>
<p>आप वर्तमान में {$a} संस्करण चला रहे हैं।</p>
<p>आपको PHP को अपग्रेड करना होगा या PHP के नए संस्करण वाले होस्ट पर जाना होगा।</p>';
$string['releasenoteslink'] = 'मूडल के इस संस्करण के बारे में जानकारी के लिए, कृपया {$a} पर रिलीज़ नोट्स देखें।';
$string['safemode'] = 'सुरक्षित प्रकार, विधा';
$string['safemodeerror'] = 'मूडल को सुरक्षित प्रकार, विधा में समस्या हो सकती है';
$string['safemodehelp'] = '<p> मूडल में सेफ प्रकार, विधा के साथ विभिन्न प्रकार की समस्याएं हो सकती हैं, कम से कम यह नहीं है कि इसे शायद नई फाइलें बनाने की अनुमत नहीं दी जाएगी। </p> <p> सेफ प्रकार, विधा आमतौर पर केवल सार्वजनिक वेब होस्ट द्वारा सक्षम होता है, इसलिए आपको बस अपनी मूडल साइट के लिए एक नई वेब होस्टिंग कंपनी खोजना पड़ सकता है। </p> <p> यदि आप चाहें तो इंस्टॉल जारी रखने की कोशिश कर सकते हैं, लेकिन बाद में कुछ समस्याओं की उम्मीद कर सकते हैं। </p>';
$string['sessionautostart'] = 'अधिवेशन की स्वत: शुरुआत';
$string['sessionautostarterror'] = 'यह बंद होना चाहिए';
$string['sessionautostarthelp'] = '<p> मूडल को अधिवेशन समर्थन की आवश्यकता होती है और इसके बिना काम नहीं करेगा। </p> <p> अधिवेशनों को php.ini दाखिल करना में सक्षम किया जा सकता है... session.auto _ start पैरामीटर की तलाश करें। </p>';
$string['sqliteextensionisnotpresentinphp'] = 'PHP को SQLite एक्सटेंशन के साथ ठीक से कॉन्फ़िगर नहीं किया गया है। कृपया अपनी php.ini फ़ाइल की जाँच करें या PHP को पुनः कंपाइल करें।';
$string['upgradingqtypeplugin'] = 'प्रश्न/प्रकार प्लगइन को उन्नत करना';
$string['welcomep20'] = 'आप इस पृष्ठ को इसलिए देख रहे हैं क्योंकि आपने अपने कंप्यूटर में <strong>{$a->packname} {$a->packversion}</strong> पैकेज को सफलतापूर्वक स्थापित और लॉन्च कर लिया है।
बधाई हो!';
$string['welcomep30'] = 'इस <strong>{$a->installername}</strong> रिलीज़ में निम्नलिखित एप्लिकेशन शामिल हैं:
एक ऐसा वातावरण बनाने के लिए जिसमें <strong>Moodle</strong> काम करेगा, अर्थात्:';
$string['welcomep40'] = 'इस पैकेज में <strong>Moodle {$a->moodlerelease} ({$a->moodleversion})</strong> भी शामिल है।';
$string['welcomep50'] = 'इस पैकेज में शामिल सभी अनुप्रयोगों का उपयोग उनके संबंधित लाइसेंसों द्वारा नियंत्रित होता है। संपूर्ण <strong>{$a->installername}</strong> पैकेज <a href="https://www.opensource.org/docs/definition_plain.html">ओपन सोर्स</a> है और इसे <a href="https://www.gnu.org/copyleft/gpl.html">GPL</a> लाइसेंस के अंतर्गत वितरित किया जाता है।';
$string['welcomep60'] = 'निम्नलिखित पृष्ठों में दिए गए आसान चरणों का पालन करके आप अपने कंप्यूटर पर <strong>मूडल </strong> को कॉन्फ़िगर और सेट अप कर सकते हैं।
आप डिफ़ॉल्ट सेटिंग्स को स्वीकार कर सकते हैं या चाहें तो उन्हें अपनी आवश्यकताओं के अनुसार बदल सकते हैं।';
$string['welcomep70'] = '<strong>मूडल </strong> के सेटअप के साथ जारी रखने के लिए नीचे दिए गए "अगले" बटन पर क्लिक करें।';
$string['wwwroot'] = 'वेब सम्बोधन';
$string['wwwrooterror'] = '\'वेब पता\' वैध नहीं लगता है-यह मूडल अधिष्ठापन वहाँ नहीं प्रतीत होती है। नीचे दिया गया मान रीसेट कर दिया गया है।';
