<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'lti', language 'hi', version '4.4'.
 *
 * @package     lti
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['accept'] = 'स्वीकार करें';
$string['accept_grades'] = 'उपकरण से ग्रेड स्वीकार करें';
$string['accept_grades_admin'] = 'उपकरण से ग्रेड स्वीकार करें';
$string['accept_grades_admin_help'] = 'विनिर्देश करना कि क्या उपकरण प्रदाता इस उपकरण के उदाहरणों से जुड़े ग्रेड जोड़ सकता है, अद्यतन सकता है, पढ़ सकता है और निकाल देना सकता है। कुछ उपकरण प्रदाता उपकरण के भीतर की गई कार्रवाइयों के आधार पर ग्रेड को वापस रिपोर्ट करने का समर्थन करते हैं, जिससे एक अधिक एकीकृत अनुभव बनता है।';
$string['accept_grades_from_tool'] = 'ग्रेडबुक में ग्रेड जोड़ने के लिए {$a} की अनुमति देना';
$string['accept_grades_help'] = 'विनिर्देश करना कि क्या उपकरण प्रदाता केवल इस बाहरी उपकरण उदाहरण से जुड़े ग्रेड दृष्टव्‍य सकता है, अद्यतन सकता है, पढ़ सकता है और निकाल देना सकता है। कुछ उपकरण प्रदाता उपकरण के भीतर की गई कार्रवाइयों के आधार पर ग्रेड को वापस रिपोर्ट करने का समर्थन करते हैं, जिससे एक अधिक एकीकृत अनुभव बनता है। ध्यान दें कि इस सेटिंग को टूल कॉन्फ़िगरेशन में ओवरराइड किया जा सकता है।';
$string['accepted'] = 'स्वीकार किया गया';
$string['action'] = 'कार्रवाई';
$string['activate'] = 'सक्रिय करें';
$string['activatetoadddescription'] = 'विवरण जोड़ने से पहले आपको इस उपकरण को सक्रिय करना होगा।';
$string['active'] = 'सक्रिय';
$string['activity'] = 'क्रियाकलाप';
$string['add_ltiadv'] = 'LTI  लाभ जोड़ें';
$string['add_ltilegacy'] = 'विरासत LTI जोड़ें';
$string['addnewapp'] = 'बाहरी अनुप्रयोग को सक्षम करें';
$string['addserver'] = 'नया विश्वसनीय सर्वर जोड़ें';
$string['addtool'] = 'उपकरण जोड़ें';
$string['addtype'] = 'पूर्व-संरचित उपकरण जोड़ें';
$string['allow'] = 'अनुमति देना';
$string['allowsetting'] = 'उपकरण को मूडल में 8k सेटिंग्स को संग्रहीत करने की अनुमति देना';
$string['always'] = 'हमेशा';
$string['autoaddtype'] = 'उपकरण जोड़ें';
$string['automatic'] = 'स्वचालित, उपकरण URL पर आधारित';
$string['baseurl'] = 'मूल URL/उपकरण पंजीकरण नाम';
$string['basiclti_base_string'] = 'LTI OAuth बेस स्ट्रिंग';
$string['basiclti_endpoint'] = 'LTI छोड़ना अंतिम बिंदु';
$string['basiclti_in_new_window'] = 'आपकी क्रियाकलाप एक नई विंडो में खुल गई है';
$string['basiclti_in_new_window_open'] = 'नई विंडो में खोलें';
$string['basiclti_parameters'] = 'LTI  छोड़ना मापदंड';
$string['basicltiactivities'] = 'LTI  गतिविधियाँ';
$string['basicltifieldset'] = 'कस्टम उदाहरण फील्डसेट';
$string['basicltiintro'] = 'क्रियाकलाप का विवरण';
$string['basicltiname'] = 'क्रियाकलाप का नाम';
$string['basicltisettings'] = 'बुनियादी शिक्षण उपकरण अंतरसंचालनीयता (LTI) सेटिंग्स';
$string['cachedef_keyset'] = 'उपकरणों की कीसेट जानकारी को कैश करता है';
$string['cancel'] = 'रद्द करना';
$string['cancelled'] = 'रद्द कर दिया गया';
$string['cannot_delete'] = 'हो सकता है कि आप इस उपकरण विन्यास को न निकाल देना दें।';
$string['cannot_edit'] = 'हो सकता है कि आप इस उपकरण विन्यास को संपादित न करें।';
$string['capabilities'] = 'क्षमताएँ';
$string['capabilities_help'] = 'उन क्षमताओं का चयन करें जिन्हें आप उपकरण प्रदाता को प्रदान करना चाहते हैं। एक से अधिक क्षमता का चयन किया जा सकता है।';
$string['capabilitiesrequired'] = 'इस उपकरण को सक्रिय करने के लिए निम्नलिखित डेटा तक पहुँच की आवश्यकता होती हैः';
$string['cleanaccesstokens'] = 'समाप्त हो चुके अभिगम टोकन को हटाने के लिए बाहरी उपकरण';
$string['click_to_continue'] = '<a href="{$a->link}" target="_top">जारी रखने के लिए क्लिक करें</a>';
$string['clientidadmin'] = 'सेवार्थ ग्राहक ID';
$string['clientidadmin_help'] = 'क्लाइंट ID एक अद्वितीय मूल्य है जिसका उपयोग किसी उपकरण की पहचान करने के लिए किया जाता है। यह प्रत्येक उपकरण के लिए स्वचालित रूप से बनाया जाता है जो LTI 1.3 में पेश किए गए  JWT  जमानत प्रोफ़ाइल का उपयोग करता है और उपकरण प्रदाता को दिए गए ब्योरा का हिस्सा होना चाहिए ताकि वे अपने अंत में संयोजन को कॉन्फ़िगर कर सकें।';
$string['comment'] = 'टिप्पणी करें';
$string['configpassword'] = 'चूक रिमोट टूल पासवर्ड';
$string['configpreferheight'] = 'चूक तरजीही ऊंचाई';
$string['configpreferwidget'] = 'विजेट को चूकना लॉन्च के रूप में सेट करें';
$string['configpreferwidth'] = 'चूक वरीयता चौड़ाई';
$string['configresourceurl'] = 'चूक संसाधन URL';
$string['configtoolurl'] = 'चूक रिमोट टूल URL';
$string['configtypes'] = 'LTI  अनुप्रयोगों को सक्षम करें';
$string['configured'] = 'संरचित';
$string['confirmtoolactivation'] = 'क्या आप सुनिश्चित हैं कि आप इस उपकरण को सक्रिय करना चाहते हैं?';
$string['contentitem_deeplinking'] = 'डीप लिंकिंग (सामग्री-वस्तु संदेश) का समर्थन करता है';
$string['contentitem_deeplinking_help'] = 'यदि टिक किया जाता है, तो एक बाहरी उपकरण जोड़ते समय \'सामग्री का चयन करें\' विकल्प उपलब्ध होगा।';
$string['contentitem_multiple_description'] = 'आपके क्रम में निम्नलिखित वस्तुओं को जोड़ा जाएगा:';
$string['contentitem_multiple_graded'] = 'श्रेणीबद्ध क्रियाकलाप (अधिकतम ग्रेड: {$a})';
$string['contentselected'] = 'चयनित सामग्री';
$string['course_tool_types'] = 'पाठ्यक्रम उपकरण';
$string['courseactivitiesorresources'] = 'पाठ्यक्रम गतिविधिअथवाँ अथवा संसाधन';
$string['courseexternaltooladd'] = 'नया LTI  बाहरी उपकरण जोड़ें';
$string['courseexternaltooladdsuccess'] = '{$a} जोड़ा गया।';
$string['courseexternaltooledit'] = '{$a} संपादित करें';
$string['courseexternaltooleditsuccess'] = 'परिवर्तनों को सहेजा गया।';
$string['courseexternaltooliconalt'] = '{$a} के लिए आइकन';
$string['courseexternaltools'] = 'LTI  बाहरी उपकरण';
$string['courseexternaltoolsinfo'] = 'LTI बाहरी उपकरण ऐड-ऑन ऐप हैं जिन्हें आप अपने क्रम में एकीकृत कर सकते हैं, जैसे कि इंटरैक्टिव सामग्री अथवा मूल्अथवांकन। आपके छात्र आपके क्रम को छोड़े बिना उनमें प्रवेश कर सकते हैं और उनका उपयोग कर सकते हैं।';
$string['courseexternaltoolsnoeditpermissions'] = 'आपके पास इस उपकरण को संपादित करने की अनुमति नहीं है';
$string['courseexternaltoolsnoviewpermissions'] = 'क्रम बाहरी उपकरणों का दृश्य';
$string['courseid'] = 'पाठ्यक्रम पहचान संख्या';
$string['courseinformation'] = 'पाठ्यक्रम की जानकारी';
$string['courselink'] = 'क्रम पर जाएँ';
$string['coursemisconf'] = 'पाठ्यक्रम गलत तरीके से संरचित है';
$string['coursetooldeleted'] = '{$a} हटा दिया गया';
$string['createdon'] = 'पर बनाया गया';
$string['curllibrarymissing'] = 'बाहरी उपकरण के लिए अपेक्षित PHP cURL विस्तार।';
$string['custom'] = 'कस्टम मापदंड';
$string['custom_config'] = 'कस्टम टूल कॉन्फ़िगरेशन का उपयोग करना।';
$string['custom_help'] = 'कस्टम मानदंड टूल प्रदाता द्वारा उपयोग की जाने वाली सेटिंग्स हैं। उदाहरण के लिए, एक कस्टम मानदंड का उपयोग प्रदाता से एक विशिष्ट संसाधन प्रदर्शित करने के लिए किया जा सकता है। प्रत्येक मानदंड को "नाम = मूल्य" के प्रारूप का उपयोग करके एक अलग पंक्ति पर दर्ज किया जाना चाहिए; उदाहरण के लिए, "अध्याय = 3"। इस क्षेत्र को तब तक अपरिवर्तित रखना सुरक्षित है जब तक कि उपकरण प्रदाता द्वारा दिष्ट न किया जाए।';
$string['custominstr'] = 'कस्टम मापदंड';
$string['debuglaunch'] = 'डीबग विकल्प';
$string['debuglaunchoff'] = 'सामान्य छोड़ना';
$string['debuglaunchon'] = 'डीबग लॉन्च';
$string['default'] = 'चूक';
$string['default_launch_container'] = 'चूक छोड़ना पात्र';
$string['default_launch_container_help'] = 'छोड़ना पात्र मार्ग से प्रक्षेपित होने पर उपकरण के सजावट को प्रभावित करता है। कुछ छोड़ना पात्र उपकरण को अधिक स्क्रीन अचल संपत्ति प्रदान करते हैं, और अन्य मूडल वातावरण के साथ अधिक एकीकृत अनुभव प्रदान करते हैं। * * * डिफ़ॉल्ट * * - उपकरण विन्अथवास द्वारा निर्दिष्ट छोड़ना पात्र का उपयोग करें। * * * एम्बेड * * - उपकरण को अधिकांश अन्य क्रिअथवाकलापयों के प्रकारों के समान तरीके से मौजूदा मूडल विंडो के भीतर प्रदर्शित किअथवा जाता है। * * * एम्बेड, बिना ब्लॉकों के * * - उपकरण को मौजूदा मूडल विंडो के भीतर प्रदर्शित किअथवा जाता है, जिसमें पृष्ठ के शीर्ष पर केवल नेविगेशन नियंत्रण होते हैं। * * * नई विंडो * * - उपकरण एक नई विंडो में खुलता है, जो सभी उपलब्ध स्थान पर कब्जा कर लेता है। ब्राउज़र के आधार पर, यह एक नए टैब अथवा पॉपअप विंडो में खुलेगा। यह संभव है कि ब्राउज़र नई विंडो को खुलने से रोकें।';
$string['delegate'] = 'अध्यापक को सौंपें';
$string['delegate_tool'] = 'जैसा कि डीप लिंकिंग परिभाषा में निर्दिष्ट है अथवा अध्यापक को सौंपा गअथवा है';
$string['delete'] = 'निकाल देना';
$string['delete_confirmation'] = 'क्या आप सुनिश्चित हैं कि आप इस पूर्व-संरचित उपकरण को हटाना चाहते हैं?';
$string['deletecoursetool'] = '{$a} निकाल देना';
$string['deletecoursetoolconfirm'] = 'यह आपके क्रम में उपलब्ध LTI  उपकरणों से {$a} निकाल देना देगा।';
$string['deletecoursetoolwithusageconfirm'] = '{$a} का उपयोग वर्तमान में आपके क्रम में कम से कम एक क्रियाकलाप में किया जा रहा है। यदि आप इस उपकरण को निकाल देना देते हैं, तो इसका उपयोग करने वाली क्रियाकलापयाँ अब काम नहीं करेंगी। <b> <b> क्या आपको यकीन है कि आप {$a} को निकाल देनाना चाहते हैं?';
$string['deletetype'] = 'पूर्व-संरचित उपकरण को निकाल देना दें';
$string['display_description'] = 'जब छात्र उपकरण तक पहुँचते हैं तो क्रियाकलाप विवरण प्रदर्शित करें';
$string['display_description_help'] = 'इस उपकरण की सामग्री क्रम में एक पृष्ठ में एम्बेडेड प्रदर्शित की जाती है। यह सेटिंग निर्धारित करती है कि उस पृष्ठ पर क्रियाकलाप का विवरण दिखाया गया है या नहीं।';
$string['display_name'] = 'जब छात्र उपकरण तक पहुँचते हैं तो क्रियाकलाप का नाम प्रदर्शित करें';
$string['display_name_help'] = 'इस उपकरण की सामग्री क्रम में एक पृष्ठ में एम्बेडेड प्रदर्शित की जाती है। यह सेटिंग निर्धारित करती है कि क्रियाकलाप का नाम उस पृष्ठ पर दिखाया गया है या नहीं।';
$string['domain_mismatch'] = 'टूल URL\'s का डोमेन टूल कॉन्फ़िगरेशन से मेल नहीं खाता है।';
$string['donot'] = 'भेजें नहीं';
$string['donotaccept'] = 'स्वीकार न करें';
$string['donotallow'] = 'अनुमति देना न दें';
$string['dontshowinactivitychooser'] = 'एक्टिविटी चॉसर में न दिखाएँ';
$string['duplicateregurl'] = 'यह पंजीकरण URL पहले से ही उपयोग में है';
$string['dynreg_update_btn_new'] = 'एक नए बाहरी उपकरण के रूप में रजिस्टर';
$string['dynreg_update_btn_update'] = 'अद्यतन';
$string['dynreg_update_name'] = 'उपकरण का नाम';
$string['dynreg_update_notools'] = 'संदर्भ में कोई उपकरण नहीं।';
$string['dynreg_update_text'] = 'पंजीकरण के क्षेत्र से मौजूदा उपकरण जुड़े हुए हैं। क्अथवा आप पहले से स्थापित बाहरी उपकरण को अद्यतन चाहते हैं अथवा एक नअथवा बाहरी उपकरण बनाना चाहते हैं?';
$string['dynreg_update_url'] = 'मूल URL';
$string['dynreg_update_version'] = 'LTI संस्करण';
$string['dynreg_update_warn_dupdomain'] = 'एक ही डोमेन अधीन कई बाहरी उपकरणों की अनुशंसा नहीं की जाती है।';
$string['editdescription'] = 'इस उपकरण का विवरण देने के लिए यहां क्लिक करें';
$string['editmanualinstancedeprecationwarning'] = 'मैन्युअल रूप से कॉन्फ़िगर की गई बाहरी टूल गतिविधियाँ अब समर्थित नहीं हैं। चिंता न करें, यह गतिविधि पहले की तरह ही काम करती रहेगी, लेकिन आप यहाँ टूल कॉन्फ़िगरेशन में कोई बदलाव नहीं कर सकते।

<br><br>
टूल में कोई भी बदलाव करने या इसके साथ नई गतिविधियाँ बनाने के लिए, कोर्स > अधिक > LTI बाहरी टूल में जाकर टूल को अपने कोर्स में जोड़ना होगा। फिर, आप गतिविधि चयनकर्ता में सीधे टूल का चयन करके नई गतिविधियाँ बना सकेंगे।

<br><br>
आप दस्तावेज़ <a href="{$a}" target="_blank">बाहरी टूल</a> में LTI बाहरी टूल जोड़ने के बारे में अधिक पढ़ सकते हैं।';
$string['edittype'] = 'पूर्व-संरचित उपकरण को संपादित करें';
$string['embed'] = 'एम्बेड';
$string['embed_no_blocks'] = 'बिना किसी ब्लॉक के एम्बेड किया गया';
$string['enableemailnotification'] = 'अधिसूचना ईमेल भेजें';
$string['enableemailnotification_help'] = 'यदि सक्षम किया जाता है, तो छात्रों को ईमेल अधिसूचना प्राप्त करना होगी जब उनके उपकरण प्रस्तुतियों को श्रेणीबद्ध किया जाएगा।';
$string['enterkeyandsecret'] = 'अपनी उपभोक्ता कुंजी दर्ज करें और साझा भेद';
$string['enterkeyandsecret_help'] = 'यदि आपको एक उपभोक्ता कुंजी और/या साझा भेद दिया गया था, तो उन्हें यहाँ दर्ज करें';
$string['entitycourseexternaltools'] = 'LTI बाहरी उपकरण';
$string['errorbadurl'] = 'URL एक वैध उपकरण URL अथवा कार्ट्रिज नहीं है।';
$string['errorincorrectconsumerkey'] = 'उपभोक्ता कुंजी गलत है।';
$string['errorinvaliddata'] = 'अमान्य डेटाः {$a}';
$string['errorinvalidmediatype'] = 'अमान्य मीडिया प्रकारः {$a}';
$string['errorinvalidresponseformat'] = 'अमान्य सामग्री-वस्तु प्रतिक्रिया प्रारूप।';
$string['errormisconfig'] = 'गलत तरीके से संरचित उपकरण। कृपया अपने मॉड्यूल प्रशासक से उपकरण के विन्यास को निश्चित करना के लिए कहें।';
$string['errortooltypenotfound'] = 'LTI  उपकरण का प्रकार नहीं मिला।';
$string['existing_window'] = 'मौजूदा खिड़की';
$string['extensions'] = 'LTI विस्तार सेवाएँ';
$string['external_tool_type'] = 'पूर्व-संरचित उपकरण';
$string['external_tool_type_help'] = '* **टूल URL के आधार पर स्वचालित** - सबसे उपयुक्त टूल कॉन्फ़िगरेशन स्वचालित रूप से चुना जाता है। यदि टूल URL पहचाना नहीं जाता है, तो टूल कॉन्फ़िगरेशन विवरण मैन्युअल रूप से दर्ज करने की आवश्यकता हो सकती है।

* **एक विशिष्ट पूर्व-कॉन्फ़िगर किया गया टूल** - बाहरी टूल प्रदाता के साथ संचार करते समय निर्दिष्ट टूल के लिए टूल कॉन्फ़िगरेशन का उपयोग किया जाएगा। यदि टूल URL टूल प्रदाता का नहीं है, तो एक चेतावनी प्रदर्शित की जाएगी। टूल URL दर्ज करना हमेशा आवश्यक नहीं होता है।

* **कस्टम कॉन्फ़िगरेशन** - उपभोक्ता कुंजी और साझा रहस्य को मैन्युअल रूप से दर्ज करने की आवश्यकता हो सकती है। उपभोक्ता कुंजी और साझा रहस्य टूल प्रदाता से प्राप्त किए जा सकते हैं। हालांकि, सभी टूल को उपभोक्ता कुंजी और साझा रहस्य की आवश्यकता नहीं होती है, ऐसी स्थिति में फ़ील्ड खाली छोड़े जा सकते हैं।

### पूर्व-कॉन्फ़िगर किए गए टूल का संपादन

पूर्व-कॉन्फ़िगर किए गए टूल ड्रॉप-डाउन मेनू के बाद तीन आइकन उपलब्ध हैं:

* **जोड़ें** - पाठ्यक्रम स्तर का टूल कॉन्फ़िगरेशन बनाएं। इस पाठ्यक्रम में सभी बाहरी टूल इंस्टेंस इस टूल कॉन्फ़िगरेशन का उपयोग कर सकते हैं।

* **संपादित करें** - ड्रॉप-डाउन मेनू से कोर्स स्तर का टूल चुनें, फिर इस आइकन पर क्लिक करें। टूल कॉन्फ़िगरेशन के विवरण संपादित किए जा सकते हैं।

* **हटाएँ** - चयनित कोर्स स्तर के टूल को हटा दें।';
$string['external_tool_types'] = 'पूर्व-संरचित उपकरण';
$string['failedtoconnect'] = 'मूडल "{$a}" तंत्र के साथ सूचित करना में असमर्थ था';
$string['failedtocreatetooltype'] = 'नया उपकरण बनाने में विफल रहा। कृपया URL की जाँच करें और फिर से प्रयास करें।';
$string['failedtodeletetoolproxy'] = 'उपकरण पंजीकरण को निकाल देना में विफल रहा। आपको "बाहरी उपकरण पंजीकरण का प्रबंधन करने" के लिए जाने और इसे हाथ से निकाल देना की आवश्यकता हो सकती है।';
$string['filter_basiclti_configlink'] = 'अपनी वरीय साइटों और उनके पासवर्ड को कॉन्फ़िगर करें';
$string['filter_basiclti_password'] = 'पासवर्ड अनिवार्य है।';
$string['filterconfig'] = 'LTI  प्रशासन';
$string['fixexistingconf'] = 'गलत कॉन्फ़िगर किए गए उदाहरण के लिए मौजूदा विन्यास का उपयोग करें';
$string['fixnew'] = 'नया विन्यास';
$string['fixnewconf'] = 'गलत तरीके से संरचित उदाहरण के लिए एक नए विन्यास को परिभाषित करें';
$string['fixold'] = 'मौजूदा का उपयोग करें';
$string['force_ssl'] = 'SSL को बाध्य करें';
$string['force_ssl_help'] = 'इस विकल्प को चुनने से इस टूल प्रदाता से होने वाले सभी लॉन्च SSL का उपयोग करने के लिए बाध्य हो जाते हैं।

इसके अलावा, टूल प्रदाता से आने वाले सभी वेब सेवा अनुरोध भी SSL का उपयोग करेंगे।

इस विकल्प का उपयोग करने से पहले, पुष्टि कर लें कि यह मूडल साइट और टूल प्रदाता SSL का समर्थन करते हैं।';
$string['forced_help'] = 'इस सेटिंग को क्रम अथवा साइट स्तर के उपकरण विन्अथवास में मजबूर किअथवा गअथवा है। हो सकता है कि आप इसे इस इंटरफेस से न बदलें।';
$string['generaltool'] = 'सार्वजनिक उपकरण';
$string['global_tool_types'] = 'पूर्व-संरचित उपकरण';
$string['grading'] = 'ग्रेड रूटिंग';
$string['icon_url'] = 'आइकन URL';
$string['icon_url_help'] = 'आइकन URL उस आइकन को अनुमति देता है जो इस क्रियाकलाप को संशोधित करने के लिए क्रम सूची में दिखाई देता है। चूकना LTI  आइकन का उपयोग करने के बजाय, एक आइकन जो क्रियाकलाप के प्रकार को व्यक्त करता है, निर्दिष्ट किया जा सकता है।';
$string['indicator:cognitivedepth'] = 'LTI संज्ञानात्मक';
$string['indicator:cognitivedepth_help'] = 'यह संकेतक एक LTI  क्रियाकलाप में छात्र द्वारा प्राप्त संज्ञानात्मक गहराई पर आधारित है।';
$string['indicator:cognitivedepthdef'] = 'LTI संज्ञानात्मक';
$string['indicator:cognitivedepthdef_help'] = 'प्रतिभागी इस विश्लेषण अंतराल के दौरान LTI  गतिविधियों द्वारा प्रस्तावित संज्ञानात्मक संलग्नता के इस प्रतिशत दर तक पहुंच गया है (स्तर = कोई दृश्य नहीं, दृश्य, प्रस्तुत, प्रतिक्रिया देखें)';
$string['indicator:cognitivedepthdef_link'] = 'Learning_analytics_indicators#Cognitive_depth';
$string['indicator:socialbreadth'] = 'LTI सामाजिक';
$string['indicator:socialbreadth_help'] = 'यह संकेतक एक LTI  क्रियाकलाप में छात्र द्वारा प्राप्त सामाजिक व्यापकता पर आधारित है।';
$string['indicator:socialbreadthdef'] = 'LTI सामाजिक';
$string['indicator:socialbreadthdef_help'] = 'प्रतिभागी इस विश्लेषण अंतराल के दौरान LTI  गतिविधियों द्वारा प्रस्तावित सामाजिक जुड़ाव के इस प्रतिशत दर तक पहुंच गया है (स्तर = कोई सहभागिता नहीं, अकेले प्रतिभागी, दूसरों के साथ प्रतिभागी)';
$string['indicator:socialbreadthdef_link'] = 'Learning_analytics_indicators#Social_breadth';
$string['initiatelogin'] = 'लॉगिन URL प्रारंभ करना, पहल करना';
$string['initiatelogin_help'] = 'जिस टूल URL पर लॉगिन शुरू करने के लिए अनुरोध भेजे जाने हैं। टूल पर सफलतापूर्वक सन्देश, सूचना भेजे जाने से पहले इस URL की अपेक्षितता होती है।';
$string['invalidid'] = 'LTI ID गलत था';
$string['keytype'] = 'सार्वजनिक कुंजी प्रकार';
$string['keytype_help'] = 'उपकरण को मान्य करने के लिए उपयोग की जाने वाली प्रमाणीकरण प्रणाली।';
$string['keytype_keyset'] = 'कीसेट URL';
$string['keytype_rsa'] = 'RSA कुंजी';
$string['launch_in_moodle'] = 'मूडल में छोड़ना उपकरण';
$string['launch_in_popup'] = 'पॉप-अप में उपकरण लॉन्च करें';
$string['launch_url'] = 'टूल URL';
$string['launch_url_help'] = 'टूल URL बाहरी टूल के वेब पते को दर्शाता है, और समाविष्ट करना अतिरिक्त जानकारी हो सकती है, जैसे कि दिखाने के लिए संसाधन। यदि आप अनिश्चित हैं कि टूल URL के लिए क्या दर्ज करना है, तो कृपया अधिक जानकारी के लिए टूल प्रदाता से संपर्क करें। यदि आपके पास एक कार्ट्रिज URL है तो आप उसे दर्ज कर सकते हैं, और बाकी फॉर्म ब्योरा स्वचालित रूप से भर जाएंगे। यदि आपने पहले से कॉन्फ़िगर किए गए उपकरण का चयन किया है, तो आपको टूल URL दर्ज करने की आवश्यकता नहीं हो सकती है। यदि टूल लिंक का उपयोग केवल टूल प्रदाता के सिस्टम में लॉन्च करने के लिए किया जाता है, और किसी विशिष्ट संसाधन पर नहीं जाता है, तो ऐसा होने की संभावना है।';
$string['launchinpopup'] = 'छोड़ना पात्र';
$string['launchinpopup_help'] = 'कोर्स से लॉन्च किए जाने पर टूल के डिस्प्ले पर लॉन्च कंटेनर का प्रभाव पड़ता है। कुछ लॉन्च कंटेनर टूल को अधिक स्क्रीन स्पेस प्रदान करते हैं, जबकि अन्य मूडल वातावरण के साथ अधिक एकीकृत अनुभव प्रदान करते हैं।

* **डिफ़ॉल्ट** - टूल कॉन्फ़िगरेशन द्वारा निर्दिष्ट लॉन्च कंटेनर का उपयोग करें।

* **एम्बेड** - टूल मौजूदा मूडल विंडो में प्रदर्शित होता है, जैसा कि अधिकांश अन्य एक्टिविटी प्रकारों में होता है।

* **एम्बेड, बिना ब्लॉक के** - टूल मौजूदा मूडल विंडो में प्रदर्शित होता है, जिसमें केवल नेविगेशन नियंत्रण पृष्ठ के शीर्ष पर होते हैं।


* **नई विंडो** - टूल एक नई विंडो में खुलता है, जो उपलब्ध सभी स्थान का उपयोग करता है।

ब्राउज़र के आधार पर, यह एक नए टैब या पॉपअप विंडो में खुलेगा।
यह संभव है कि ब्राउज़र नई विंडो को खुलने से रोकें।';
$string['launchoptions'] = 'लॉन्च विकल्प';
$string['lti:addcoursetool'] = 'पाठ्यक्रम-विशिष्ट उपकरण विन्यास जोड़ें';
$string['lti:addinstance'] = 'एक नया बाहरी उपकरण जोड़ें';
$string['lti:addmanualinstance'] = 'एक मैन्युअल रूप से कॉन्फ़िगर किया गया उपकरण जोड़ें';
$string['lti:addmanualinstanceprohibitederror'] = 'क्रम उपकरण परिभाषा के बिना उपकरणों का शारीरिक निर्माण अब समर्थित नहीं है। कृपया पहले एक क्रम उपकरण बनाएँ और फिर क्रियाकलाप के उदाहरण बनाने के लिए इसका उपयोग करें।';
$string['lti:addpreconfiguredinstance'] = 'एक पूर्व-संरचित उपकरण जोड़ें';
$string['lti:admin'] = 'जब उपकरण लॉन्च किया जाए तो प्रशासक बनें';
$string['lti:grade'] = 'बाहरी उपकरण द्वारा लौटाए गए ग्रेड देखें';
$string['lti:manage'] = 'जब उपकरण शुरू किया जाए तो प्रशिक्षक बनें';
$string['lti:requesttooladd'] = 'अनुरोध करें कि एक उपकरण को साइट-वाइड कॉन्फ़िगर किया गया है';
$string['lti:view'] = 'बाहरी उपकरण गतिविधियाँ शुरू करें';
$string['lti_administration'] = 'पूर्व-संरचित उपकरण को संपादित करें';
$string['lti_errormsg'] = 'उपकरण ने निम्नलिखित त्रुटि सन्देश, सूचना लौटाया: "{$a}"';
$string['lti_launch_error'] = 'बाहरी उपकरण को लॉन्च करते समय एक त्रुटि हुईः';
$string['lti_launch_error_tool_request'] = '<p>
टूल कॉन्फ़िगरेशन पूरा करने के लिए प्रशासक से अनुरोध सबमिट करने हेतु, <a href="{$a->admin_request_url}" target="_top">यहाँ</a> क्लिक करें।

</p>';
$string['lti_launch_error_unsigned_help'] = '<p>यह त्रुटि टूल प्रदाता के लिए उपभोक्ता कुंजी और साझा रहस्य के अनुपलब्ध होने का परिणाम हो सकती है।</p>
<p>यदि आपके पास उपभोक्ता कुंजी और साझा रहस्य है, तो आप इसे बाहरी टूल इंस्टेंस को संपादित करते समय दर्ज कर सकते हैं (सुनिश्चित करें कि उन्नत विकल्प दिखाई दे रहे हैं)।</p>
<p>वैकल्पिक रूप से, आप <a href="{$a->course_tool_editor}">एक कोर्स स्तर टूल प्रदाता कॉन्फ़िगरेशन बना सकते हैं</a>।</p>';
$string['lti_tool_request_added'] = 'उपकरण विन्यास अनुरोध सफलतापूर्वक प्रस्तुत किया गया। उपकरण विन्यास को पूरा करने के लिए आपको किसी प्रशासक से संपर्क करने की आवश्यकता हो सकती है।';
$string['lti_tool_request_existing'] = 'टूल डोमेन के लिए एक टूल कॉन्फ़िगरेशन पहले ही जमा किया जा चुका है।';
$string['ltisettings'] = 'LTI  सेटिंग्स';
$string['ltiunknownserviceapicall'] = 'LTI अज्ञात सेवा API कॉल।';
$string['ltiversion'] = 'LTI  संस्करण';
$string['ltiversion_help'] = 'संदेशों और सेवा अनुरोधों पर हस्ताक्षर करने के लिए उपयोग किए जा रहे LTI का संस्करण: LTI 1.0/1.1 और LTI 2.0 OAuth 1.0A सुरक्षा प्रोफ़ाइल का उपयोग करते हैं; LTI 1.3.0 JWT का उपयोग करता है।';
$string['main_admin'] = 'सार्वजनिक सहायता';
$string['main_admin_help'] = 'बाहरी टूल मूडल उपयोगकर्ताओं को दूरस्थ रूप से होस्ट किए गए शिक्षण संसाधनों के साथ इंटरैक्ट करने की अनुमति देते हैं। एक विशेष लॉन्च प्रोटोकॉल के माध्यम से, दूरस्थ टूल को लॉन्च करने वाले उपयोगकर्ता के बारे में सामान्य जानकारी प्राप्त होती है। उदाहरण के लिए, संस्थान का नाम, कोर्स आईडी, उपयोगकर्ता आईडी और उपयोगकर्ता का नाम या ईमेल पता जैसी अन्य जानकारी।

इस पृष्ठ पर सूचीबद्ध टूल को तीन श्रेणियों में विभाजित किया गया है:

* **सक्रिय** - इन टूल प्रदाताओं को एक प्रशासक द्वारा अनुमोदित और कॉन्फ़िगर किया गया है। इनका उपयोग इस साइट के किसी भी कोर्स के भीतर किया जा सकता है। यदि एक उपभोक्ता कुंजी और साझा गुप्त कुंजी दर्ज की जाती है, तो इस साइट और दूरस्थ टूल के बीच एक विश्वास संबंध स्थापित हो जाता है, जिससे एक सुरक्षित संचार चैनल उपलब्ध होता है।

* **लंबित** - ये टूल प्रदाता पैकेज आयात के माध्यम से आए हैं, लेकिन एक प्रशासक द्वारा कॉन्फ़िगर नहीं किए गए हैं। यदि शिक्षकों के पास उपभोक्ता कुंजी और साझा गुप्त कुंजी है, या यदि इनकी आवश्यकता नहीं है, तो वे इन प्रदाताओं के टूल का उपयोग कर सकते हैं।

* **अस्वीकृत** - इन टूल प्रदाताओं को ऐसे के रूप में चिह्नित किया गया है जिन्हें प्रशासक साइट पर उपलब्ध कराने का इरादा नहीं रखता है। यदि शिक्षकों के पास उपभोक्ता कुंजी और साझा गुप्त कुंजी है, या यदि इनमें से किसी की भी आवश्यकता नहीं है, तो वे इन प्रदाताओं के उपकरणों का उपयोग कर सकते हैं।';
$string['manage_external_tools'] = 'उपकरणों का प्रबंधन करें';
$string['manage_tool_proxies'] = 'बाहरी उपकरण पंजीकरण का प्रबंधन करें';
$string['manage_tools'] = 'पूर्व-संरचित उपकरणों का प्रबंधन करें';
$string['manuallyaddtype'] = 'वैकल्पिक रूप से, आप <a href="{$a}">किसी टूल को मैन्युअल रूप से कॉन्फ़िगर कर सकते हैं</a>।';
$string['miscellaneous'] = 'फुटकर';
$string['misconfiguredtools'] = 'गलत तरीके से बनाए गए उपकरण के उदाहरण पाए गए';
$string['missingparameterserror'] = 'पृष्ठ गलत तरीके से संरचित हैः "{$a}"';
$string['module_class_type'] = 'मॉड्यूल का प्रकार';
$string['modulename'] = 'बाहरी उपकरण';
$string['modulename_help'] = 'बाह्य उपकरण गतिविधि मॉड्यूल छात्रों को अन्य वेबसाइटों पर उपलब्ध शिक्षण संसाधनों और गतिविधियों के साथ अंतःक्रिया करने में सक्षम बनाता है। उदाहरण के लिए, एक बाह्य उपकरण किसी प्रकाशक से किसी नए प्रकार की गतिविधि या शिक्षण सामग्री तक पहुँच प्रदान कर सकता है।

एक बाह्य उपकरण गतिविधि बनाने के लिए, एक ऐसे उपकरण प्रदाता की आवश्यकता होती है जो LTI (लर्निंग टूल्स इंटरऑपरेबिलिटी) का समर्थन करता हो। एक शिक्षक बाह्य उपकरण गतिविधि बना सकता है या साइट प्रशासक द्वारा कॉन्फ़िगर किए गए उपकरण का उपयोग कर सकता है।

बाह्य उपकरण गतिविधियाँ URL संसाधनों से कुछ मायनों में भिन्न होती हैं:

* बाह्य उपकरण संदर्भ-जागरूक होते हैं, अर्थात् उनके पास उपकरण लॉन्च करने वाले उपयोगकर्ता के बारे में जानकारी होती है, जैसे संस्थान, पाठ्यक्रम और नाम।
* बाह्य उपकरण गतिविधि से संबंधित ग्रेड को पढ़ने, अपडेट करने और हटाने का समर्थन करते हैं।
* बाह्य उपकरण कॉन्फ़िगरेशन आपकी साइट और उपकरण प्रदाता के बीच एक विश्वास संबंध स्थापित करते हैं, जिससे उनके बीच सुरक्षित संचार संभव होता है।';
$string['modulename_link'] = 'mod/lti/view';
$string['modulenameplural'] = 'External tools';
$string['modulenamepluralformatted'] = 'बाहरी उपकरण';
$string['name'] = 'नाम';
$string['never'] = 'कभी नहीं';
$string['new_window'] = 'नई खिड़की';
$string['no_lti_configured'] = 'कॉन्फ़िगर किए गए कोई सक्रिय बाहरी उपकरण नहीं हैं।';
$string['no_lti_pending'] = 'कोई विचाराधीन बाहरी उपकरण नहीं हैं।';
$string['no_lti_rejected'] = 'कोई अस्वीकृत बाहरी उपकरण नहीं हैं।';
$string['no_lti_tools'] = 'कोई बाहरी उपकरण कॉन्फ़िगर नहीं किए गए हैं।';
$string['no_tp_accepted'] = 'कोई स्वीकृत बाहरी उपकरण पंजीकरण नहीं हैं।';
$string['no_tp_cancelled'] = 'कोई रद्द किए गए बाहरी उपकरण पंजीकरण नहीं हैं।';
$string['no_tp_configured'] = 'कोई अपंजीकृत बाहरी उपकरण पंजीकरण कॉन्फ़िगर नहीं किए गए हैं।';
$string['no_tp_pending'] = 'कोई विचाराधीन बाहरी उपकरण पंजीकरण नहीं हैं।';
$string['no_tp_rejected'] = 'कोई अस्वीकृत बाहरी उपकरण पंजीकरण नहीं हैं।';
$string['noattempts'] = 'इस उपकरण उदाहरण पर कोई प्रयास नहीं किया गया है';
$string['nocourseexternaltoolsnotice'] = 'अभी तक कोई LTI बाहरी उपकरण नहीं हैं।';
$string['noltis'] = 'कोई बाहरी उपकरण उदाहरण नहीं हैं';
$string['noprofileservice'] = 'प्रोफ़ाइल सेवा नहीं मिली';
$string['noservers'] = 'कोई सर्वर नहीं मिला';
$string['notypes'] = 'वर्तमान में मूडल में कोई LTI  उपकरण स्थापित नहीं हैं। कुछ जोड़ने के लिए ऊपर दिए गए इंस्टॉल लिंक पर क्लिक करें।';
$string['noviewusers'] = 'इस उपकरण का उपयोग करने की अनुमति के साथ कोई उपयोगकर्ता नहीं पाया गया';
$string['opensslconfiginvalid'] = 'LTI 1.3  के लिए एक वैध openssl.cnf को कॉन्फ़िगर करने और आपके वेब सर्वर पर उपलब्ध होने की आवश्यकता होती है। कृपया इस साइट के लिए ओपनएसएल को कॉन्फ़िगर करने और सक्षम करने के लिए साइट प्रशासक से संपर्क करें।';
$string['optionalsettings'] = 'वैकल्पिक सेटिंग्स';
$string['organization'] = 'संगठन का ब्योरा';
$string['organizationdescr'] = 'संगठन का विवरण';
$string['organizationid_default'] = 'चूक संगठन ID';
$string['organizationid_default_help'] = 'संगठन आईडी के लिए उपयोग करने के लिए चूकना मूल्य। साइट ID मूडल की इस अधिष्ठापन की पहचान करती है।';
$string['organizationidguid'] = 'संगठन ID';
$string['organizationidguid_help'] = 'इस मूडल उदाहरण के लिए एक अद्वितीय पहचानकर्ता प्लेटफॉर्म उदाहरण गाइड के रूप में उपकरण को पारित किया गया। यदि यह क्षेत्र खाली छोड़ दिया जाता है, तो चूकना मूल्य का उपयोग किया जाएगा।';
$string['organizationurl'] = 'संगठन URL';
$string['organizationurl_help'] = 'इस मॉड्यूल उदाहरण का मूल URL  यदि इस क्षेत्र को खाली छोड़ दिया जाता है, तो साइट विन्यास के मूल पर एक चूकना मूल्य का उपयोग किया जाएगा।';
$string['pagesize'] = 'प्रति पृष्ठ दिखाई गई प्रस्तुतियाँ';
$string['parameter'] = 'उपकरण मापदंड';
$string['parameter_help'] = 'टूल पैरामीटर्स सेटिंग्स हैं जिन्हें टूल प्रदाता द्वारा स्वीकृत टूल प्रॉक्सी में पारित करने का अनुरोध किया जाता है।';
$string['password'] = 'साझा भेद';
$string['password_admin'] = 'साझा भेद';
$string['password_admin_help'] = 'साझा भेद को उपकरण तक पहुँच को प्रमाणित करने के लिए उपयोग किए जाने वाले पासवर्ड के रूप में सोचा जा सकता है। इसे उपकरण प्रदाता से उपभोक्ता कुंजी के साथ बशर्ते, यह कि जाना चाहिए। जिन उपकरणों को मूडल से सुरक्षित संचार की आवश्यकता नहीं होती है और अतिरिक्त सेवाएं (जैसे ग्रेड रिपोर्टिंग) प्रदान नहीं करते हैं, उन्हें एक साझा भेद की आवश्यकता नहीं हो सकती है।';
$string['password_help'] = 'पूर्व-संरचित उपकरणों के लिए, यहाँ एक साझा भेद दर्ज करना आवश्यक, जरूरी नहीं है, क्योंकि साझा भेद विन्यास प्रक्रम के हिस्से के रूप में बशर्ते, यह कि जाएगा। यदि किसी उपकरण प्रदाता का लिंक बनाया जाता है जो पहले से कॉन्फ़िगर नहीं है तो इस क्षेत्र में प्रवेश किया जाना चाहिए। यदि इस क्रम में उपकरण प्रदाता का एक से अधिक बार उपयोग किया जाना है, तो एक क्रम उपकरण विन्यास जोड़ना एक अच्छा विचार है। साझा भेद को उपकरण तक पहुँच को प्रमाणित करने के लिए उपयोग किए जाने वाले पासवर्ड के रूप में सोचा जा सकता है। इसे उपकरण प्रदाता से उपभोक्ता कुंजी के साथ बशर्ते, यह कि जाना चाहिए। जिन उपकरणों को मूडल से सुरक्षित संचार की आवश्यक, जरूरीता नहीं होती है और अतिरिक्त सेवाएं प्रदान नहीं करते हैं (जैसे कि ग्रेड रिपोर्टिंग) उन्हें एक साझा भेद की आवश्यक, जरूरीता नहीं हो सकती है।';
$string['pending'] = 'विचाराधीन';
$string['pluginadministration'] = 'बाहरी उपकरण प्रशासन';
$string['pluginname'] = 'बाहरी उपकरण';
$string['preferheight'] = 'वरीय ऊंचाई';
$string['preferwidget'] = 'पसंद का विजेट लॉन्च';
$string['preferwidth'] = 'वरीय चौड़ाई';
$string['press_to_submit'] = 'इस क्रियाकलाप को शुरू करने के लिए दबाएँ';
$string['privacy'] = 'गोपनीयता';
$string['privacy:metadata:coursefullname'] = 'जिस क्रम से उपयोगकर्ता LTI उपभोक्ता तक पहुँच रहा है, उसका पूरा नाम';
$string['privacy:metadata:courseid'] = 'जिस क्रम से उपयोगकर्ता LTI  उपभोक्ता तक पहुँच रहा है, उसकी पहचान';
$string['privacy:metadata:courseidnumber'] = 'जिस क्रम से उपयोगकर्ता LTI  उपभोक्ता तक पहुँच रहा है, उसकी पहचान संख्या';
$string['privacy:metadata:courseshortname'] = 'जिस क्रम से उपयोगकर्ता LTI  उपभोक्ता तक पहुँच रहा है, उसका संक्षिप्त नाम';
$string['privacy:metadata:createdby'] = 'वह उपयोगकर्ता जिसने अभिलेख बनाया';
$string['privacy:metadata:email'] = 'LTI उपभोक्ता तक पहुँचने वाले उपयोगकर्ता का ईमेल सम्बोधन';
$string['privacy:metadata:externalpurpose'] = 'LTI  उपभोक्ता LTI उपकरण प्रदाता को उपयोगकर्ता जानकारी और संदर्भ प्रदान करता है।';
$string['privacy:metadata:firstname'] = 'LTI  उपभोक्ता तक पहुँचने वाले उपयोगकर्ता का पहला नाम';
$string['privacy:metadata:fullname'] = 'LTI उपभोक्ता तक पहुँचने वाले उपयोगकर्ता का पूरा नाम';
$string['privacy:metadata:lastname'] = 'LTI  उपभोक्ता तक पहुँचने वाले उपयोगकर्ता का अंतिम नाम';
$string['privacy:metadata:lti_submission'] = 'LTI  जमा करना';
$string['privacy:metadata:lti_submission:datesubmitted'] = 'टाइमस्टैम्प इंगित करता है कि कब जमा किया गया था';
$string['privacy:metadata:lti_submission:dateupdated'] = 'समय टिकट से पता चलता है कि जमा करने को कब संशोधित किया गया था';
$string['privacy:metadata:lti_submission:gradepercent'] = 'प्रतिशत दर के रूप में उपयोगकर्ता के लिए ग्रेड';
$string['privacy:metadata:lti_submission:originalgrade'] = 'उपयोगकर्ता के लिए मूल ग्रेड';
$string['privacy:metadata:lti_submission:userid'] = 'LTI  क्रियाकलाप के लिए जमा करने वाले उपयोगकर्ता की ID';
$string['privacy:metadata:lti_tool_proxies'] = 'LTI  प्रॉक्सी';
$string['privacy:metadata:lti_tool_proxies:name'] = 'LTI  प्रॉक्सी नाम';
$string['privacy:metadata:lti_types'] = 'LTI  प्रकार';
$string['privacy:metadata:lti_types:name'] = 'LTI प्रकार का नाम';
$string['privacy:metadata:role'] = 'LTI उपभोक्ता तक पहुँचने वाले उपयोगकर्ता के लिए क्रम में भूमिका';
$string['privacy:metadata:timecreated'] = 'वह समय जब अभिलेख बनाया गया था';
$string['privacy:metadata:timemodified'] = 'वह समय जब अभिलेख को संशोधित किया गया था';
$string['privacy:metadata:userid'] = 'LTI उपभोक्ता तक पहुँचने वाले उपयोगकर्ता की ID';
$string['privacy:metadata:useridnumber'] = 'LTI  उपभोक्ता तक पहुँचने वाले उपयोगकर्ता का ID  संख्या';
$string['privacy:metadata:username'] = 'LTI उपभोक्ता तक पहुँचने वाले उपयोगकर्ता का उपयोगकर्ता नाम';
$string['publickey'] = 'सार्वजनिक कुंजी';
$string['publickey_help'] = 'आने वाले संदेशों और सेवा अनुरोधों के हस्ताक्षरों को सत्यापित करने की अनुमति देना के लिए उपकरण द्वारा बशर्ते, यह कि गई सार्वजनिक कुंजी (पेम प्रारूप में)।';
$string['publickeyset'] = 'सार्वजनिक कुंजी सेट';
$string['publickeyset_help'] = 'सार्वजनिक कुंजी सेट जहाँ से यह साइट आने वाले संदेशों और सेवा अनुरोधों के हस्ताक्षर को सत्यापित करने की अनुमति देना के लिए उपकरण की सार्वजनिक कुंजी प्राप्त करेगी।';
$string['quickgrade'] = 'त्वरित श्रेणीकरण की अनुमति देना';
$string['quickgrade_help'] = 'यदि सक्षम है, तो एक पृष्ठ पर कई उपकरणों को श्रेणीबद्ध किया जा सकता है। ग्रेड और टिप्पणी जोड़ें और फिर उस पृष्ठ के लिए सभी परिवर्तनों को सहेजने के लिए "मेरी सभी प्रतिक्रियाएँ सहेजें" बटन पर क्लिक करें।';
$string['redirect'] = 'आपको कुछ ही सेकंड में पुनर्निर्देशित कर दिया जाएगा। यदि आप नहीं करते हैं, तो बटन दबाएँ।';
$string['redirectionuris'] = 'पुनर्निर्देशन यूरी (ओं)';
$string['redirectionuris_help'] = 'URIs  की एक सूची (प्रति पंक्ति एक) जिसका उपयोग उपकरण प्राधिकरण अनुरोध करते समय करता है। उपकरण पर सफलतापूर्वक सन्देश, सूचना भेजे जाने से पहले कम से कम एक पंजीकृत होना चाहिए।';
$string['register'] = 'रजिस्टर';
$string['register_warning'] = 'ऐसा लगता है कि पंजीकरण पृष्ठ को खुलने में कुछ समय लग रहा है। यदि यह दिखाई नहीं देता है, तो जाँच करें कि आपने विन्यास सेटिंग्स में सही URL दर्ज किया है। यदि मूडल एच. टी. एस. का उपयोग कर रहा है, तो सुनिश्चित करना कि आप जिस उपकरण को कॉन्फ़िगर कर रहे हैं वह https  का समर्थन करता है और आप URL  में https  का उपयोग कर रहे हैं।';
$string['registertype'] = 'एक नया बाहरी उपकरण पंजीकरण कॉन्फ़िगर करें';
$string['registration_options'] = 'पंजीकरण विकल्प';
$string['registrationname'] = 'उपकरण प्रदाता का नाम';
$string['registrationname_help'] = 'पंजीकृत किए जा रहे उपकरण प्रदाता का नाम दर्ज करें।';
$string['registrationurl'] = 'पंजीकरण URL';
$string['registrationurl_help'] = 'पंजीकरण URL उपकरण प्रदाता से उस स्थान के रूप में उपलब्ध होना चाहिए जहाँ पंजीकरण अनुरोध भेजे जाने चाहिए।';
$string['reject'] = 'अस्वीकार करें';
$string['rejected'] = 'अस्वीकृत';
$string['resource'] = 'संसाधन';
$string['resourcekey'] = 'उपभोक्ता कुंजी';
$string['resourcekey_admin'] = 'उपभोक्ता कुंजी';
$string['resourcekey_admin_help'] = 'उपभोक्ता कुंजी को उपकरण तक पहुँच को प्रमाणित करने के लिए उपयोग किए जाने वाले उपयोगकर्ता नाम के रूप में सोचा जा सकता है। इसका उपयोग उपकरण प्रदाता द्वारा उस मूडल साइट की विशिष्ट रूप से पहचान करने के लिए किअथवा जा सकता है जहाँ से उपयोगकर्ता उपकरण में प्रवेश करते हैं। उपभोक्ता कुंजी उपकरण प्रदाता द्वारा बशर्ते, यह कि जानी चाहिए। उपभोक्ता कुंजी प्राप्त करने की प्रणाली उपकरण प्रदाताओं के बीच भिन्न होती है। यह एक स्वचालित प्रक्रम हो सकती है, अथवा इसके लिए उपकरण प्रदाता के साथ संवाद की आवश्यकता हो सकती है। जिन उपकरणों को मूडल से सुरक्षित संचार की आवश्यकता नहीं होती है और अतिरिक्त सेवाएं प्रदान नहीं करते हैं (जैसे कि ग्रेड रिपोर्टिंग) उन्हें संसाधन कुंजी की आवश्यकता नहीं हो सकती है।';
$string['resourcekey_help'] = 'पहले से कॉन्फ़िगर किए गए टूल के लिए, यहां संसाधन कुंजी दर्ज करना आवश्यक नहीं है, क्योंकि उपभोक्ता कुंजी कॉन्फ़िगरेशन प्रक्रिया के दौरान प्रदान की जाएगी।

यदि आप किसी ऐसे टूल प्रदाता से लिंक बना रहे हैं जो पहले से कॉन्फ़िगर नहीं है, तो इस फ़ील्ड को भरना चाहिए।
यदि इस कोर्स में टूल प्रदाता का एक से अधिक बार उपयोग किया जाना है, तो कोर्स टूल कॉन्फ़िगरेशन जोड़ना एक अच्छा विचार है।

उपभोक्ता कुंजी को टूल तक पहुंच को प्रमाणित करने के लिए उपयोग किए जाने वाले उपयोगकर्ता नाम के रूप में समझा जा सकता है।

इसका उपयोग टूल प्रदाता द्वारा उस मूडल साइट की विशिष्ट पहचान करने के लिए किया जा सकता है जहां से उपयोगकर्ता टूल लॉन्च करते हैं।

उपभोक्ता कुंजी टूल प्रदाता द्वारा प्रदान की जानी चाहिए। उपभोक्ता कुंजी प्राप्त करने की विधि टूल प्रदाताओं के बीच भिन्न होती है।
यह एक स्वचालित प्रक्रिया हो सकती है, या इसके लिए टूल प्रदाता के साथ बातचीत की आवश्यकता हो सकती है।

वे टूल जिन्हें मूडल से सुरक्षित संचार की आवश्यकता नहीं होती है और जो अतिरिक्त सेवाएं (जैसे ग्रेड रिपोर्टिंग) प्रदान नहीं करते हैं,
उन्हें संसाधन कुंजी की आवश्यकता नहीं हो सकती है।';
$string['resourceurl'] = 'संसाधन URL';
$string['restricttocategory_help'] = 'श्रेणी तक सीमित';
$string['return_to_course'] = 'कोर्स पर वापस जाने के लिए <a href="{$a->link}" target="_top">यहां</a> क्लिक करें।';
$string['saveallfeedback'] = 'मेरी सभी प्रतिक्रियाएँ सेव करें';
$string['search:activity'] = 'बाहरी उपकरण-क्रियाकलाप की जानकारी';
$string['secure_icon_url'] = 'सुरक्षित आइकन URL';
$string['secure_icon_url_help'] = 'आइकन URL के समान, लेकिन SSL की वजह से, के बाहर, में से, से होकर, के द्वारा साइट को सुरक्षित रूप से एक्सेस करने पर उपयोग किया जाता है। यह क्षेत्र ब्राउज़र को असुरक्षित छवि के बारे में चेतावनी प्रदर्शित करने से रोकने के लिए है।';
$string['secure_launch_url'] = 'सुरक्षित उपकरण URL';
$string['secure_launch_url_help'] = 'टूल URL के समान, लेकिन उच्च जमानत की अपेक्षितता होने पर टूल URL के बजाय उपयोग किअथवा जाता है। यदि मूडल साइट को SSL की वजह से, के बाहर, में से, से होकर, के द्वारा एक्सेस किअथवा जाता है, अथवा यदि टूल कॉन्फ़िगरेशन को हमेशा SSL की वजह से, के बाहर, में से, से होकर, के द्वारा लॉन्च करने के लिए सेट किअथवा जाता है, तो मूडल टूल URL के बजाय सुरक्षित टूल URL का उपयोग करेगा। टूल यूआरएल को SSL की वजह से, के बाहर, में से, से होकर, के द्वारा लॉन्च करने के लिए एक https  पते पर भी सेट किअथवा जा सकता है, और इस क्षेत्र को खाली छोड़ दिअथवा जा सकता है।';
$string['selectcontent'] = 'सामग्री का चयन करें';
$string['selectcontentvalidationerror'] = 'आपको इस क्रियाकलाप के लिए सामग्री का चयन करना होगा।';
$string['send'] = 'भेजें';
$string['services'] = 'सेवाएँ';
$string['services_help'] = 'उन सेवाओं का चयन करें जिन्हें आप उपकरण प्रदाता को प्रदान करना चाहते हैं। एक से अधिक सेवाओं का चयन किया जा सकता है।';
$string['setupoptions'] = 'सेटअप विकल्प';
$string['share_email'] = 'उपकरण के साथ लांचर का ईमेल साझा करें';
$string['share_email_admin'] = 'उपकरण के साथ लांचर का ईमेल साझा करें';
$string['share_email_admin_help'] = 'विनिर्देश करना कि टूल लॉन्च करने वाले उपयोगकर्ता का ई-मेल सम्बोधन टूल प्रदाता के साथ साझा किअथवा जाएगा अथवा नहीं। टूल प्रदाता को UI में एक ही नाम वाले उपयोगकर्ताओं को अलग करने के लिए लॉन्चर के ई-मेल पते की आवश्यकता हो सकती है, अथवा टूल के भीतर की कार्रवाइयों के आधार पर उपयोगकर्ताओं को ई-मेल भेजने की आवश्यकता हो सकती है।';
$string['share_email_help'] = 'विनिर्देश करना कि टूल लॉन्च करने वाले उपयोगकर्ता का ई-मेल सम्बोधन टूल प्रदाता के साथ साझा किअथवा जाएगा अथवा नहीं। टूल प्रदाता को एक ही नाम के उपयोगकर्ताओं को अलग करने के लिए लॉन्चर के ईमेल पते की आवश्यकता हो सकती है, अथवा टूल के भीतर की कार्रवाइयों के आधार पर उपयोगकर्ताओं को ईमेल भेज सकते हैं। ध्अथवान दें कि इस सेटिंग को टूल कॉन्फ़िगरेशन में ओवरराइड किअथवा जा सकता है।';
$string['share_name'] = 'उपकरण के साथ लांचर का नाम साझा करें';
$string['share_name_admin'] = 'उपकरण के साथ लांचर का नाम साझा करें';
$string['share_name_admin_help'] = 'विनिर्देश करना कि उपकरण को लॉन्च करने वाले उपयोगकर्ता का पूरा नाम उपकरण प्रदाता के साथ साझा किया जाना चाहिए या नहीं। उपकरण प्रदाता को उपकरण के भीतर सार्थक जानकारी दिखाने के लिए प्रक्षेपक के नामों की आवश्यकता हो सकती है।';
$string['share_name_help'] = 'विनिर्देश करना कि उपकरण को लॉन्च करने वाले उपयोगकर्ता का पूरा नाम उपकरण प्रदाता के साथ साझा किया जाना चाहिए या नहीं। उपकरण प्रदाता को उपकरण के भीतर सार्थक जानकारी दिखाने के लिए प्रक्षेपक के नामों की आवश्यकता हो सकती है। ध्यान दें कि इस सेटिंग को टूल कॉन्फ़िगरेशन में ओवरराइड किया जा सकता है।';
$string['share_roster'] = 'उपकरण को इस क्रम के रोस्टर तक पहुँचने दें';
$string['share_roster_admin'] = 'उपकरण क्रम रोस्टर तक पहुँच सकता है';
$string['share_roster_admin_help'] = 'विनिर्देश करना कि क्या उपकरण उन उपयोगकर्ताओं की सूची तक पहुँच सकता है जो उन पाठ्यक्रमों में नामांकित हैं जिनसे यह उपकरण शुरू किया गया है।';
$string['share_roster_help'] = 'विनिर्देश करना कि क्या उपकरण इस क्रम में नामांकित उपयोगकर्ताओं की सूची तक पहुँच सकता है। ध्यान दें कि इस सेटिंग को टूल कॉन्फ़िगरेशन में ओवरराइड किया जा सकता है।';
$string['show_in_course_activity_chooser'] = 'क्रियाकलाप चयनकर्ता में और एक पूर्व-संरचित उपकरण के रूप में दिखाएँ';
$string['show_in_course_lti1'] = 'उपकरण विन्यास उपयोग';
$string['show_in_course_lti1_help'] = 'इस उपकरण को एक अध्यापक के लिए एक क्रम में जोड़ने के लिए चयन करना के लिए क्रियाकलाप चयनकर्ता में दिखाया जा सकता है। वैकल्पिक रूप से, इसे क्रम में एक बाहरी उपकरण जोड़ते समय पूर्व-संरचित उपकरण ड्रॉप-डाउन मेनू में दिखाया जा सकता है। एक अन्य विकल्प यह है कि उपकरण विन्यास का उपयोग केवल तभी किया जाए जब किसी क्रम में बाहरी उपकरण जोड़ते समय सटीक उपकरण URL दर्ज किया जाए।';
$string['show_in_course_lti2'] = 'उपकरण विन्यास उपयोग';
$string['show_in_course_lti2_help'] = 'इस उपकरण को एक अध्अथवापक के लिए एक क्रम में जोड़ने के लिए चयन करना के लिए क्रिअथवाकलाप चयनकर्ता में अथवा एक क्रम में एक बाहरी उपकरण जोड़ते समय पहले से कॉन्फ़िगर किए गए उपकरण ड्रॉप-डाउन मेनू में दिखाअथवा जा सकता है।';
$string['show_in_course_no'] = 'दिखाएँ नहीं; केवल तभी उपयोग करें जब एक मिलान उपकरण URL दर्ज किया जाए';
$string['show_in_course_preconfigured'] = 'एक बाहरी उपकरण जोड़ते समय पूर्व-संरचित उपकरण के रूप में दिखाएँ';
$string['showinactivitychooser'] = 'क्रियाकलाप चयनकर्ता में दिखाएँ';
$string['sitehost'] = 'साइट होस्टनाम';
$string['siteid'] = 'साइट ID';
$string['size'] = 'आकार मापदंड';
$string['submission'] = 'प्रस्तुत करना, निवेदन';
$string['submissions'] = 'प्रस्तुत करना, निवेदन';
$string['submissionsfor'] = '{$a} के लिए प्रस्तुतियाँ';
$string['subplugintype_ltiresource'] = 'LTI  सेवा संसाधन';
$string['subplugintype_ltiresource_plural'] = 'LTI  सेवा संसाधन';
$string['subplugintype_ltiservice'] = 'LTI  सेवा';
$string['subplugintype_ltiservice_plural'] = 'LTI  सेवा संसाधन';
$string['subplugintype_ltisource'] = 'LTI  उद्गम';
$string['subplugintype_ltisource_plural'] = 'LTI  उद्गम';
$string['successfullycreatedtooltype'] = 'सफलतापूर्वक नया उपकरण बनाया!';
$string['successfullyfetchedtoolconfigurationfromcontent'] = 'चयनित सामग्री से उपकरण विन्यास सफलतापूर्वक प्राप्त किया।';
$string['toggle_debug_data'] = 'डीबग डेटा को टॉगल करें';
$string['tool_config_not_found'] = 'इस URL के लिए उपकरण विन्यास नहीं मिला।';
$string['tool_settings'] = 'उपकरण सेटिंग्स';
$string['tooldescription'] = 'उपकरण विवरण';
$string['tooldescription_help'] = 'क्रियाकलाप सूची में अध्यापकों को प्रदर्शित किए जाने वाले उपकरण का विवरण। यह वर्णन करना चाहिए कि उपकरण किस लिए है और यह क्या करता है और किसी भी अतिरिक्त जानकारी को अध्यापक को जानने की आवश्यकता हो सकती है।';
$string['tooldetailsaccesstokenurl'] = 'सांकेतिक URL तक पहुँचें';
$string['tooldetailsauthrequesturl'] = 'प्रमाणीकरण अनुरोध URL';
$string['tooldetailsclientid'] = 'सेवार्थ ग्राहक ID';
$string['tooldetailsdeploymentid'] = 'तैनाती ID';
$string['tooldetailsmailtosubject'] = 'LTI  उपकरण विन्यास';
$string['tooldetailsmodalemail'] = 'ईमेल';
$string['tooldetailsmodallink'] = 'विन्यास ब्योरा देखें';
$string['tooldetailsmodaltitle'] = 'उपकरण विन्यास ब्योरा';
$string['tooldetailsplatformid'] = 'प्लेटफॉर्म ID';
$string['tooldetailspublickeyseturl'] = 'सार्वजनिक कीसेट URL';
$string['toolisbeingused'] = 'इस उपकरण का उपयोग {$a} बार किया जा रहा है';
$string['toolisnotbeingused'] = 'इस उपकरण का अभी तक उपयोग नहीं किया गया है';
$string['toolproxy'] = 'बाहरी उपकरण पंजीकरण';
$string['toolproxy_help'] = 'बाह्य टूल पंजीकरण Moodle साइट प्रशासकों को LTI 2.0 समर्थित टूल प्रदाता से प्राप्त टूल प्रॉक्सी का उपयोग करके बाह्य टूल कॉन्फ़िगर करने की अनुमति देते हैं। प्रक्रिया शुरू करने के लिए टूल प्रदाता द्वारा प्रदान किया गया पंजीकरण URL ही पर्याप्त है। नया पंजीकरण कॉन्फ़िगर करते समय टूल प्रदाता द्वारा दी जाने वाली क्षमताओं और सेवाओं का चयन किया जाता है।

इस पृष्ठ पर सूचीबद्ध टूल पंजीकरणों को चार श्रेणियों में विभाजित किया गया है:

* **कॉन्फ़िगर किया गया** - इन टूल पंजीकरणों को सेटअप कर लिया गया है, लेकिन पंजीकरण प्रक्रिया अभी शुरू नहीं हुई है।

* **लंबित** - इन टूल पंजीकरणों की पंजीकरण प्रक्रिया शुरू हो गई है, लेकिन पूरी नहीं हुई है। इसे वापस \'कॉन्फ़िगर किया गया\' श्रेणी में ले जाने के लिए सेटिंग्स खोलें और सहेजें।

* **स्वीकृत** - इन टूल पंजीकरणों को स्वीकृत कर दिया गया है; टूल प्रॉक्सी में निर्दिष्ट संसाधन पूर्व-कॉन्फ़िगर किए गए टूल पृष्ठ पर \'लंबित\' की प्रारंभिक स्थिति के साथ दिखाई देंगे।

* **अस्वीकृत** - ये वे टूल पंजीकरण हैं जिन्हें पंजीकरण प्रक्रिया के दौरान अस्वीकार कर दिया गया था। सेटिंग्स को खोलें और सहेजें ताकि इसे वापस \'कॉन्फ़िगर किए गए\' श्रेणी में ले जाया जा सके और पंजीकरण प्रक्रिया को पुनः आरंभ किया जा सके।';
$string['toolproxyregistration'] = 'बाहरी उपकरण पंजीकरण';
$string['toolregistration'] = 'बाहरी उपकरण पंजीकरण';
$string['toolsetup'] = 'बाहरी उपकरण पंजीकरण';
$string['tooltypeadded'] = 'पूर्व-संरचित उपकरण जोड़ा गया';
$string['tooltypedeleted'] = 'पूर्व-संरचित उपकरण हटा दिया गया';
$string['tooltypenotdeleted'] = 'पूर्व-संरचित उपकरण को निकाल देना नहीं सके';
$string['tooltypenotfounderror'] = 'इस क्रिअथवाकलाप में उपयोग किए गए LTI  उपकरण को हटा दिअथवा गअथवा है। यदि आपको सहायता की आवश्यकता है, तो अपने अध्अथवापक अथवा साइट प्रशासक से संपर्क करें।';
$string['tooltypes'] = 'उपकरण';
$string['tooltypeupdated'] = 'पूर्व-संरचित उपकरण अद्यतन किया गया';
$string['toolurl'] = 'टूल URL';
$string['toolurl_contentitemselectionrequest'] = 'सामग्री चयन, प्रवरण URL';
$string['toolurl_contentitemselectionrequest_help'] = 'सामग्री चयन, प्रवरण, प्रवरण URL का उपयोग उपकरण प्रदाता से सामग्री चयन, प्रवरण, प्रवरण पृष्ठ को लॉन्च करने के लिए किया जाएगा। यदि यह खाली है, तो उपकरण URL का उपयोग किया जाएगा।';
$string['toolurl_help'] = 'टूल URL का उपयोग टूल URL को सही टूल कॉन्फ़िगरेशन से मिलाने के लिए किया जाता है। URL के आगे http लगाना वैकल्पिक है।

इसके अतिरिक्त, यदि बाहरी टूल इंस्टेंस में कोई टूल URL निर्दिष्ट नहीं है, तो बेस URL को टूल URL के रूप में उपयोग किया जाता है।

उदाहरण के लिए, *tool.com* का बेस URL निम्न से मेल खाएगा:

* tool.com
* tool.com/quizzes
* tool.com/quizzes/quiz.php?id=10
* www.tool.com/quizzes

*www.tool.com/quizzes* का बेस URL निम्न से मेल खाएगा:

* www.tool.com/quizzes
* tool.com/quizzes
* tool.com/quizzes/take.php?id=10

*quiz.tool.com* का बेस URL निम्न से मेल खाएगा:

* quiz.tool.com
* quiz.tool.com/take.php?id=10

यदि एक ही डोमेन के लिए दो अलग-अलग टूल कॉन्फ़िगरेशन हैं, तो सबसे सटीक मिलान का उपयोग किया जाएगा।

यदि आपके पास कार्ट्रिज URL है, तो आप उसे भी डाल सकते हैं और टूल का विवरण स्वचालित रूप से भर जाएगा।';
$string['toolurlplaceholder'] = 'टूल URL...';
$string['typename'] = 'उपकरण का नाम';
$string['typename_help'] = 'उपकरण नाम का उपयोग मॉड्यूल के भीतर उपकरण प्रदाता की पहचान करने के लिए किया जाता है। पाठ्यक्रमों के भीतर बाहरी उपकरणों को जोड़ते समय दर्ज किया गया नाम शिक्षकों को दिखाई देगा।';
$string['types'] = 'प्रकार';
$string['unabletocreatetooltype'] = 'उपकरण बनाने में असमर्थ';
$string['unabletofindtooltype'] = '{$a-> id} के लिए उपकरण खोजने में असमर्थ';
$string['unknownstate'] = 'अज्ञात सूबा';
$string['update'] = 'अद्यतन';
$string['usage'] = 'उपयोग की संख्या';
$string['useraccountinformation'] = 'उपयोगकर्ता खाते की जानकारी';
$string['userpersonalinformation'] = 'उपयोगकर्ता की व्यक्तिगत जानकारी';
$string['using_tool_cartridge'] = 'टूल कार्ट्रिज का उपयोग करना';
$string['using_tool_configuration'] = 'उपकरण विन्यास का उपयोग करनाः';
$string['validurl'] = 'एक वैध URL की शुरुआत http(s):// से होनी चाहिए।';
$string['viewsubmissions'] = 'सबमिशन और ग्रेडिंग स्क्रीन देखें';
